{
  "count": 50,
  "prospects": [
    {
      "handle": "rotaryeclubhi",
      "display_name": "Rotary E-Club of Hawaii",
      "follower_count": 1938,
      "bio": "The first E-Club in District 5000! Join us at our meetings, every second Monday at 12 noon HST via Zoom Meeting ID:...",
      "website": "rotaryeclubhawaii.org",
      "hawaii_based": true,
      "reasoning_hawaii": "Name is 'Rotary E-Club of Hawaii', District 5000 (Hawaii district), meetings in HST (Hawaii Standard Time). Explicitly Hawaii-based Rotary club.",
      "entity_type": "member_org",
      "reasoning_type": "Rotary Club - the exact type of member-based service organization highlighted as HIGH VALUE in the framework. First E-Club in Rotary District 5000 (Hawaii). Virtual meeting format (Zoom) for accessibility.",
      "capacity": "HIGH",
      "reasoning_capacity": "Rotary Club members are typically affluent business owners and professionals. Rotary International has significant philanthropic infrastructure. Service projects shown in highlights (#beathungerhi, Hoola Na Pua).",
      "alignment": "HIGH",
      "reasoning_alignment": "Rotary clubs focus on community service, vocational service, and humanitarian efforts. Active service projects in Hawaii (#beathungerhi, Hoola Na Pua partnership). Strong community service orientation directly aligns with supporting service dog accessibility.",
      "relationship": "HIGH",
      "reasoning_relationship": "Rotary clubs are inherently welcoming to guest speakers and nonprofit presentations. Regular meeting schedule (every second Monday via Zoom). Service organizations actively seek worthy causes to support.",
      "impact": "HIGH",
      "reasoning_impact": "One presentation = access to entire club membership of affluent business owners and professionals. Rotary network extends across District 5000 (all Hawaii clubs). Service project infrastructure already exists. Could lead to multi-club support across Hawaii. This is exactly the framework's example of a HIGH impact member organization.",
      "score": 92,
      "outreach_type": "DIRECT_FUNDING",
      "outreach_strategy": "TOP PRIORITY. Request to present at a Rotary E-Club meeting (every second Monday, Zoom format makes it easy). Rotary clubs regularly fund community service projects. One presentation reaches entire membership of affluent professionals. Success here could cascade to other Rotary clubs in District 5000 across Hawaii. Prepare a compelling 15-minute presentation with clear ask for service project funding."
    },
    {
      "handle": "rceasthonolulu",
      "display_name": "Rotary Club of East Honolulu",
      "follower_count": 664,
      "bio": "Community Organization\nTogether, we see a world where people unite & take action to create lasting change across the globe, in our communities,...",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Name explicitly states 'East Honolulu'. Self-identifies as a community organization in Honolulu.",
      "entity_type": "member_org",
      "reasoning_type": "Rotary Club - classic member-based service organization. Rotary clubs consist of local business owners and professionals committed to community service.",
      "capacity": "HIGH",
      "reasoning_capacity": "Rotary clubs are composed of affluent local business owners and professionals. Members have personal and business resources. The club itself has fundraising infrastructure and a tradition of supporting community causes.",
      "alignment": "HIGH",
      "reasoning_alignment": "Rotary's mission is community service and creating 'lasting change.' Service dogs for accessibility directly aligns with Rotary's focus on community health, disability support, and vocational service. Rotary clubs frequently support disability-related causes.",
      "relationship": "HIGH",
      "reasoning_relationship": "Rotary clubs are specifically designed to welcome community presentations and partnership proposals. They actively seek worthy causes to support. Local East Honolulu presence makes them very accessible.",
      "impact": "HIGH",
      "reasoning_impact": "One presentation to the Rotary Club = access to dozens of affluent East Honolulu business owners and professionals. Rotary members can individually donate, sponsor, and open doors to their own businesses and networks. Classic multiplier effect.",
      "score": 92,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "TOP PRIORITY. Request a speaking slot at a Rotary Club of East Honolulu meeting to present Hawaii FIDO's mission. Prepare a compelling 15-20 minute presentation about service dog accessibility in Hawaii. One presentation reaches the entire membership of affluent East Honolulu business leaders. Follow up with individual member meetings. Rotary members can become individual donors, corporate sponsors through their businesses, and advocates who open doors to other organizations."
    },
    {
      "handle": "assistancedogsofhawaii",
      "display_name": "Assistance Dogs Of Hawaii",
      "follower_count": 4152,
      "bio": "Nonprofit organization\nAssistance Dogs of Hawaii is a 501(c)(3) charitable organization that provides children and adults with professionally...\nwww.assistancedogshawaii.org/donate",
      "website": "www.assistancedogshawaii.org/donate",
      "hawaii_based": true,
      "reasoning_hawaii": "Named 'Assistance Dogs of Hawaii.' Website confirms Hawaii location with programs across the state. 501(c)(3) Hawaii nonprofit.",
      "entity_type": "nonprofit",
      "reasoning_type": "Hawaii 501(c)(3) nonprofit providing assistance dogs (service dogs, hospital facility dogs, courthouse facility dogs). Programs include therapy dog teams, veteran's program, community outreach, educational presentations, and puppy raising. Has gala fundraiser (Puppy Love Gala 2026).",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established 501(c)(3) with multiple programs, staff, gala fundraiser, volunteer infrastructure, and puppy raising program. Organized nonprofit with donor base and institutional structure.",
      "alignment": "HIGH",
      "reasoning_alignment": "DIRECT mission alignment - Assistance Dogs of Hawaii provides service dogs, therapy dogs, and facility dogs. Almost identical mission to FIDO. Both serve the assistance/service dog community in Hawaii.",
      "relationship": "HIGH",
      "reasoning_relationship": "Fellow Hawaii service dog nonprofit. Most natural partnership possible. Already doing similar work. Could be a sister organization or collaborative partner.",
      "impact": "HIGH",
      "reasoning_impact": "Access to their entire service dog community - handlers, puppy raisers, donors, volunteers. Joint advocacy amplifies both organizations. Shared fundraising could benefit both.",
      "score": 90,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "HIGHEST PRIORITY. Assistance Dogs of Hawaii is the most natural partner for FIDO - they have almost identical missions. Approach for strategic alliance: co-hosted events (their Puppy Love Gala), shared advocacy for service dog accessibility, joint educational presentations, cross-referrals, and coordinated fundraising. Collaboration rather than competition will strengthen both organizations."
    },
    {
      "handle": "auwsyl",
      "display_name": "AUW Society of Young Leaders",
      "follower_count": 2672,
      "bio": "Nonprofit organization\nAloha United Way Society of Young Leaders is a group of young professionals who make a positive impact in Hawai'i!...",
      "website": "linktr.ee/auwsyl",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'positive impact in Hawai'i'. Affiliated with Aloha United Way (Hawaii's United Way chapter). Website shows Honolulu events.",
      "entity_type": "member_org",
      "reasoning_type": "Young professionals group under Aloha United Way. Member-based organization with volunteer events, membership structure, and board/committee roles. Functions as a professional networking and service organization.",
      "capacity": "HIGH",
      "reasoning_capacity": "Backed by Aloha United Way - one of Hawaii's largest nonprofits. Young professionals group means members have professional incomes. Has formal membership structure, board, committees, and organized volunteer events.",
      "alignment": "HIGH",
      "reasoning_alignment": "Aloha United Way is a major community service organization. Young Leaders group focuses on community impact in Hawaii. Strong community service orientation aligns well with service dog accessibility mission.",
      "relationship": "HIGH",
      "reasoning_relationship": "Nonprofit with formal structure, volunteer events, and membership sign-up. Very approachable - they actively recruit members and host community events. Linktree shows active engagement (upcoming events, member forms).",
      "impact": "HIGH",
      "reasoning_impact": "Member-based organization of young professionals backed by Aloha United Way. One presentation = access to dozens of young professionals with disposable income. Door-opener to broader Aloha United Way network. Active volunteer events mean ready-made partnership opportunities.",
      "score": 90,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "TOP PRIORITY. Request to present at an AUW SYL meeting or event. Young professionals with community service orientation are ideal donors and volunteers. Connection to Aloha United Way opens doors to major fundraising infrastructure. Propose a joint volunteer event (e.g., service dog training day). One relationship here could cascade to significant funding through United Way channels."
    },
    {
      "handle": "neverquitdreaming",
      "display_name": "Never Quit Dreaming",
      "follower_count": 9562,
      "bio": "Nonprofit organization\nfor the Hawaiian Islands\nOffering accommodating activities for Hawaii's special needs children\n96819\nlinktr.ee/neverquitdreaming",
      "website": "linktr.ee/neverquitdreaming",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit 'for the Hawaiian Islands.' Bio mentions 'Hawaii's special needs children.' ZIP code 96819 (Honolulu). Website confirms Hawaii focus.",
      "entity_type": "nonprofit",
      "reasoning_type": "Hawaii nonprofit providing activities for special needs children. Programs include sports (tennis, martial arts, baseball, basketball, soccer, golf), DJ school, and art programs. Partners with local organizations.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established nonprofit with multiple programs, partnerships, and community presence. Organized sports and activity programs suggest moderate organizational resources and donor base.",
      "alignment": "HIGH",
      "reasoning_alignment": "Disability/accessibility nonprofit serving Hawaii's special needs children. Direct mission overlap with FIDO's service dog accessibility focus. Both serve the disability community in Hawaii.",
      "relationship": "HIGH",
      "reasoning_relationship": "Fellow Hawaii nonprofit serving the disability community. Natural partner organization. Their programs (sports for special needs children) could directly integrate service dog awareness.",
      "impact": "HIGH",
      "reasoning_impact": "Access to families of special needs children - a primary audience for service dogs. Partnership reaches the exact population FIDO serves. Cross-referral potential is enormous.",
      "score": 85,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority partnership opportunity. Never Quit Dreaming serves Hawaii's special needs children - exactly the population that benefits from service dogs. Propose joint programming (service dog awareness at their sports events), cross-referrals (families who need service dogs), and co-fundraising. This is a natural strategic alliance with enormous mutual benefit."
    },
    {
      "handle": "ohanadoggiedaycare",
      "display_name": "ohanadoggiedaycare",
      "follower_count": 2118,
      "bio": "We are Hawaii's first cage-free daycare boarding facility and grooming spa, with over 21 years of experience and happy...",
      "website": "www.ohanadoggiedaycare.net",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio states 'Hawaii's first cage-free daycare'. Website confirms: 'first and largest dog daycare in Honolulu, Hawaii proudly serving our community for 20 YEARS!'",
      "entity_type": "pet_industry",
      "reasoning_type": "Established dog daycare, boarding, and grooming facility in Honolulu. Hawaii's first cage-free facility with 21+ years of experience. Multi-service pet business.",
      "capacity": "HIGH",
      "reasoning_capacity": "21+ years in operation - exceptional longevity. Hawaii's first and largest dog daycare. Physical facility in Honolulu. Multiple services (daycare, boarding, spa). 2536 posts showing consistent long-term presence. Established business with significant infrastructure.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dog daycare and boarding directly serves Hawaii's dog community. 'Expand the human-dog bond' mission (from website) closely aligns with service dog mission. 21 years of dog care experience is deeply relevant.",
      "relationship": "HIGH",
      "reasoning_relationship": "Established, long-running Hawaii business. Open to community engagement (following 6753 accounts shows active community participation). Professional business with website and social presence.",
      "impact": "HIGH",
      "reasoning_impact": "21+ years serving Honolulu dog community = deep network of dog owners. Hawaii's largest dog daycare means access to thousands of dog-owning families. Physical facility can host events. Institutional credibility from longevity. One partnership = access to entire client base.",
      "score": 85,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "HIGH PRIORITY partnership. 21+ years as Hawaii's largest dog daycare gives deep community roots and massive client base of dog owners. Propose: display Hawaii FIDO materials at facility, host fundraising events, offer boarding discounts for service dog families, cross-promote. Their mission to 'expand the human-dog bond' directly aligns. Long-standing credibility makes them an ideal flagship partner."
    },
    {
      "handle": "guidedogsofhawaii",
      "display_name": "Guide Dogs of Hawai'i",
      "follower_count": 1351,
      "bio": "Nonprofit organization\nServing the blind & visually impaired of Hawai'i since 1955.",
      "website": "guidedogsofhawaii.org/home",
      "hawaii_based": true,
      "reasoning_hawaii": "Name is 'Guide Dogs of Hawai'i'. Physical address at 1130 N. Nimitz Hwy. #C301, Honolulu, Hawaii 96817. Serving Hawaii since 1955. Website confirms Hawaii-based nonprofit with multiple Hawaii-specific services.",
      "entity_type": "nonprofit",
      "reasoning_type": "Nonprofit organization serving blind and visually impaired individuals in Hawaii since 1955. Provides guide dog services, youth services, adult services, peer groups, and advocacy.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established nonprofit since 1955 (70+ years). Has physical office, professional website, organized programs (Camp Get Ahead, events, services). Structured organization with multiple service lines. However, as a nonprofit, financial capacity for donations to other nonprofits is limited.",
      "alignment": "HIGH",
      "reasoning_alignment": "Directly aligned as a guide dog/service dog organization serving people with disabilities in Hawaii. Guide dogs and service dogs serve the same population. Disability accessibility is their core mission. Perfect mission overlap with FIDO.",
      "relationship": "HIGH",
      "reasoning_relationship": "Fellow Hawaii-based nonprofit in the service dog/disability space. Natural peer organization. Would understand FIDO's mission immediately. Professional organization with clear contact channels.",
      "impact": "HIGH",
      "reasoning_impact": "70+ year institution with deep roots in Hawaii's disability community. Access to blind/visually impaired community, guide dog handlers, advocates, and donors. Co-branding opportunities. Policy advocacy connections. A partnership here lends enormous credibility.",
      "score": 85,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority partnership target. Approach as a peer organization for collaboration rather than funding. Propose joint events, shared advocacy, cross-referrals, and co-branded awareness campaigns. Their 70+ year history and guide dog expertise complement FIDO's service dog work. Joint fundraising events could leverage both donor bases. This is a strategic alliance, not a donation ask."
    },
    {
      "handle": "moph483",
      "display_name": "Military Order of The Purple Heart - Chapter 483",
      "follower_count": 288,
      "bio": "Aloha! and Welcome to the official page of the Military Order of The Purple Heart Rainbow Chapter 483 Hawaii...",
      "website": "www.zeffy.com/en-US/donation-form/military-order-of-the-purple-heart-chapter--483",
      "hawaii_based": true,
      "reasoning_hawaii": "Name includes 'Hawaii'. Bio says 'Aloha!' and 'Rainbow Chapter 483 Hawaii'. Donation page confirms Hawaii chapter.",
      "entity_type": "member_org",
      "reasoning_type": "Military veteran organization - local chapter of the Military Order of the Purple Heart. Member-based organization of combat-wounded veterans.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "National veteran organization with local chapter. Has fundraising infrastructure (Zeffy donation platform). Members are combat-wounded veterans with varied financial backgrounds. Access to national MOPH resources.",
      "alignment": "HIGH",
      "reasoning_alignment": "Veterans organization with direct connection to service dogs. PTSD and physical disability service dogs are widely used by combat-wounded veterans. Purple Heart recipients have service-connected disabilities that often benefit from service dogs. Extremely high mission alignment.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based veteran member organization. Veterans groups are typically very receptive to service dog organizations. 'Aloha' greeting and community focus suggest openness.",
      "impact": "HIGH",
      "reasoning_impact": "Member-based organization of combat-wounded veterans. One presentation could reach all chapter members. Connection to national MOPH organization. Veterans community is highly networked. Can refer members who need service dogs and advocate within the veteran community.",
      "score": 85,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority prospect. Military Order of the Purple Heart Chapter 483 Hawaii has direct alignment - combat-wounded veterans are prime beneficiaries of service dogs for PTSD and physical disabilities. Request to present at a chapter meeting about service dog programs for veterans. Propose a partnership to connect their members with Hawaii FIDO's services. This is both a referral source for service dog recipients AND a fundraising opportunity through their member network."
    },
    {
      "handle": "efmphawaii",
      "display_name": "EFMP Marine Corps Base Hawaii",
      "follower_count": 241,
      "bio": "Government organization\nEFMP MCB Hawaii serves military family members with physical, emotional, developmental and medical special needs",
      "website": "www.mccshawaii.com/efmp",
      "hawaii_based": true,
      "reasoning_hawaii": "Name includes 'Hawaii'. EFMP (Exceptional Family Member Program) at Marine Corps Base Hawaii. Government military program in Hawaii.",
      "entity_type": "government_official",
      "reasoning_type": "Government military program - EFMP (Exceptional Family Member Program) at Marine Corps Base Hawaii. Serves military families with special needs members.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Military government program with institutional backing. Part of Marine Corps Community Services Hawaii. Has programmatic resources and budget for supporting special needs families. Not a personal funding source but can facilitate access to military resources.",
      "alignment": "HIGH",
      "reasoning_alignment": "EFMP serves military family members with physical, emotional, developmental, and medical special needs - exactly the population that benefits from service dogs. Service dogs for military families with disabilities is a direct mission alignment. Military service dogs for PTSD and disabilities are well-established.",
      "relationship": "HIGH",
      "reasoning_relationship": "Government program specifically designed to serve special needs military families. These programs actively seek resources and partnerships to support their families. Very receptive to service dog organizations.",
      "impact": "HIGH",
      "reasoning_impact": "Gateway to the entire military community at MCB Hawaii. Access to military families with special needs across the base. Connection to Marine Corps Community Services network. One relationship opens doors to military leadership, family support programs, and potentially DoD-level resources.",
      "score": 85,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority prospect. EFMP at Marine Corps Base Hawaii serves exactly the families who need service dogs - military members with physical, emotional, and developmental special needs. Propose a formal partnership to provide service dog assessments and training for EFMP-enrolled families. Present at EFMP family events. This is a strategic gateway to the military community in Hawaii and could lead to DoD-level support and funding. Contact the EFMP coordinator to schedule a presentation."
    },
    {
      "handle": "the_oahu_spca",
      "display_name": "Oahu SPCA - OFFICIAL ACCOUNT",
      "follower_count": 14300,
      "bio": "Every life is precious\n808-754-1519\nHours: Mon-Sat: 8am-5pm, Sun: by appointment only\noahuspca.org",
      "website": "oahuspca.org",
      "hawaii_based": true,
      "reasoning_hawaii": "Oahu SPCA - explicitly Hawaii-based animal welfare organization. 808 area code. Website confirms Oahu location with services across the island.",
      "entity_type": "nonprofit",
      "reasoning_type": "Animal welfare nonprofit (SPCA) on Oahu. Offers adoption, veterinary services, vaccine clinics, spay/neuter, trap-neuter-release, fostering, volunteering, and events.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established nonprofit with facilities, staff, regular hours, veterinary services, sponsorship programs, and multiple revenue streams (adoption fees, clinics, donations). Organizational resources are moderate.",
      "alignment": "HIGH",
      "reasoning_alignment": "Animal welfare nonprofit on Oahu with direct mission overlap. SPCA deals with animal rescue, adoption, and welfare - closely aligned with FIDO's animal-focused mission. Both serve Hawaii's animal community.",
      "relationship": "HIGH",
      "reasoning_relationship": "Fellow Hawaii nonprofit in the animal welfare space. Natural ally and potential collaborator. SPCA organizations are typically open to partnerships with aligned nonprofits.",
      "impact": "HIGH",
      "reasoning_impact": "Major animal welfare institution on Oahu with established donor base, volunteer network, and community credibility. Partnership provides access to their supporter network and legitimacy in the animal welfare space.",
      "score": 82,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a sister nonprofit for strategic partnership. Oahu SPCA is a natural ally in the animal welfare space. Propose co-hosted events (e.g., adoption + service dog awareness day), cross-referrals, shared fundraising campaigns, and joint advocacy for animal welfare legislation. The SPCA's established donor and volunteer network is extremely valuable."
    },
    {
      "handle": "heartofkailua",
      "display_name": "Julianne King",
      "follower_count": 3767,
      "bio": "Community\nLet's change the understanding of autism! Mother, wife, friend.....taking action is my antidote. Www... \nmore\nhawaiiautismfoundation.org",
      "website": "hawaiiautismfoundation.org",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle references Kailua (Oahu town), website is hawaiiautismfoundation.org which is a Hawaii-based nonprofit.",
      "entity_type": "nonprofit",
      "reasoning_type": "Founder/leader of Hawaii Autism Foundation, a nonprofit organization focused on autism awareness and services in Hawaii.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Nonprofit leader with established organization (hawaiiautismfoundation.org has programs, events, Spelling to Communicate offerings). Has organizational infrastructure but nonprofit resources are typically limited.",
      "alignment": "HIGH",
      "reasoning_alignment": "Strong disability/accessibility mission alignment. Autism foundation directly connects to disability community which overlaps with service dog accessibility. Service dogs are used for autism support, creating direct mission synergy.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based community leader, active on social media with 3767 followers, handle 'heartofkailua' suggests deep community roots. Nonprofit leaders are typically open to collaboration with aligned organizations.",
      "impact": "HIGH",
      "reasoning_impact": "Access to autism community in Hawaii, potential to connect Hawaii FIDO with families who could benefit from service dogs. Nonprofit network connections, community advocacy experience, and established organizational platform.",
      "score": 82,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a mission-aligned partner. Autism service dogs are a direct intersection point. Propose joint programming or cross-referrals for families with autism who could benefit from service dogs. Offer to present at Hawaii Autism Foundation events."
    },
    {
      "handle": "tailshawaii",
      "display_name": "Tails of Hawaii | Hawaii's Best Pet Boarding and Daycare",
      "follower_count": 2466,
      "bio": "Pet Service\nDoggie Daycare\nDog & Cat Boarding\nSpa Services\nPet Transport @tailmovershawaii\nSit & Sip Cafe\n98-751 Kuahao Pl, St 102, Pearl City, Hawaii 96782",
      "website": "www.tailsofhawaii.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Physical address: 98-751 Kuahao Pl, St 102, Pearl City, Hawaii 96782. Multiple Hawaii-branded services including pet transport arm (@tailmovershawaii).",
      "entity_type": "pet_industry",
      "reasoning_type": "Comprehensive pet services business: daycare, boarding, spa, pet transport, and cafe. Multi-service pet business with physical location in Pearl City.",
      "capacity": "HIGH",
      "reasoning_capacity": "Established multi-service pet business with physical location, multiple service lines (daycare, boarding, spa, transport, cafe), 1595 posts showing longevity. Business names itself 'Hawaii's Best' suggesting market leadership. Separate pet transport business (@tailmovershawaii) shows expansion.",
      "alignment": "HIGH",
      "reasoning_alignment": "Direct pet services business in Hawaii. Doggie daycare, boarding, and spa directly serve dog owners - Hawaii FIDO's target community. Pet transport service could assist with service dog logistics.",
      "relationship": "HIGH",
      "reasoning_relationship": "Established local pet business with physical location, multiple services, and professional branding. Very accessible for partnership discussions. Already serving Hawaii dog community.",
      "impact": "HIGH",
      "reasoning_impact": "Large customer base of Hawaii dog owners - exactly Hawaii FIDO's target audience. Physical location for events/materials. Multiple service lines create multiple partnership touchpoints. Could reach thousands of dog owners through their business.",
      "score": 82,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority partnership. Propose multi-faceted collaboration: display Hawaii FIDO materials at facility, host fundraising events at their cafe (Sit & Sip), offer discounts to service dog families, cross-promote through @tailmovershawaii for service dog transport. Their customer base IS Hawaii FIDO's target audience. Could become a flagship business partner."
    },
    {
      "handle": "gonorthshore",
      "display_name": "North Shore Chamber",
      "follower_count": 1494,
      "bio": "Working to make the North Shore a better place to live, work & play!",
      "website": "linktr.ee/gonorthshore",
      "hawaii_based": true,
      "reasoning_hawaii": "North Shore Chamber of Commerce. Address at 66-434 Kamehameha Hwy, Haleiwa, Hawaii 96712. '100 Years' highlight suggests a century of operation on the North Shore of Oahu.",
      "entity_type": "member_org",
      "reasoning_type": "Chamber of Commerce - a member-based business organization representing North Shore businesses and community. Linktree shows membership dues and sponsorship options.",
      "capacity": "HIGH",
      "reasoning_capacity": "Chamber of Commerce with 100+ years of operation. Members include North Shore businesses. Has membership dues and sponsorship structures in place, indicating institutional financial management.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Community-focused organization working to improve North Shore. No direct service dog or accessibility focus, but community betterment mission overlaps with FIDO's accessibility goals. Community organizations are generally open to supporting local nonprofits.",
      "relationship": "HIGH",
      "reasoning_relationship": "Member-based organization that hosts events, takes sponsorships, and engages businesses. Chamber of Commerce exists to foster community connections. Very approachable for presentations and partnership proposals.",
      "impact": "HIGH",
      "reasoning_impact": "Chamber of Commerce provides direct access to North Shore business community. One presentation = access to dozens of local business owners. 100+ year institution has deep roots and credibility. Multiplier effect is the key value.",
      "score": 82,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "High-value target. Request a presentation slot at a Chamber meeting or luncheon to present FIDO's mission to assembled North Shore business owners. Chamber members are decision-makers who can individually sponsor or donate. Also explore sponsorship of a FIDO event through the Chamber. One relationship here opens doors to the entire North Shore business community."
    },
    {
      "handle": "repbranco",
      "display_name": "Rep. Patrick Pihana Branco",
      "follower_count": 1090,
      "bio": "Public figure\nHawaiʻi State House Representative for District 50 (Kailua & Kāneʻohe Bay).\nlinktr.ee/repbranco\nFollow\nMessage\nResources\nCOVID-19\nOn The Go\nKNB",
      "website": "linktr.ee/repbranco",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicitly stated: 'Hawaiʻi State House Representative for District 50 (Kailua & Kāneʻohe Bay).' Official Hawaii state government representative.",
      "entity_type": "government_official",
      "reasoning_type": "Hawaii State House Representative for District 50. Public figure in state government.",
      "capacity": "HIGH",
      "reasoning_capacity": "As a state representative, has authority over state funding and policy decisions. Can influence government budgets, advocate for legislative support for service dog programs, and direct state resources.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "No direct mention of service dogs or disability issues, but as a state representative covering Kailua and Kaneohe Bay, he deals with community welfare, accessibility, and constituent services. Government officials handle disability-related legislation.",
      "relationship": "HIGH",
      "reasoning_relationship": "Public figure with listed contact methods (linktree, message). State reps are expected to engage with constituents and local organizations. His district covers Windward Oahu which likely overlaps with Hawaii FIDO's service area.",
      "impact": "HIGH",
      "reasoning_impact": "State representatives can advocate at the legislative level, open doors to government funding, influence policy on service dog accessibility, and provide institutional credibility. One relationship can lead to legislative support and connections to other officials.",
      "score": 82,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "High-value government contact. Approach through official constituent channels requesting a meeting about service dog accessibility in District 50. Frame Hawaii FIDO's work as benefiting his constituents in Kailua and Kaneohe Bay. Ask for legislative advocacy on service dog access rights and potential state funding. Can open doors to other government officials and state resources."
    },
    {
      "handle": "friendsofhawaii",
      "display_name": "FriendsOfHawaii",
      "follower_count": 386,
      "bio": "Friends of Hawaii Charities established in '98 by community leaders to help non-profit programs that benefit Hawaii's...",
      "website": "www.friendsofhawaii.org",
      "hawaii_based": true,
      "reasoning_hawaii": "Name is 'Friends of Hawaii Charities'. Website is friendsofhawaii.org. Established by Hawaii community leaders. Clearly Hawaii-based.",
      "entity_type": "nonprofit",
      "reasoning_type": "Charitable organization established in 1998 by community leaders to support nonprofit programs benefiting Hawaii. Has a board of directors, executive committee, Friends Club membership, and hosts events.",
      "capacity": "HIGH",
      "reasoning_capacity": "Established since 1998, has a board of directors and executive committee, runs events, has a 'Friends Club' membership program, and a 'Contribute' section. Long-standing charity infrastructure suggests significant fundraising capacity and donor networks.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Supports nonprofit programs that benefit Hawaii. Not specifically animal or disability focused, but their mission to help Hawaii nonprofits directly includes organizations like Hawaii FIDO. They are a grantmaker/supporter of local nonprofits.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based charity that explicitly exists to support local nonprofits. They have a community engagement model, events, and a contribution mechanism. Highly accessible and relevant.",
      "impact": "HIGH",
      "reasoning_impact": "Access to community leaders, board members, and the broader network of Hawaii nonprofits. Established for 25+ years. Events and membership program create multiplier effect. One relationship could open doors to their entire donor and nonprofit network.",
      "score": 82,
      "outreach_type": "DIRECT_FUNDING",
      "outreach_strategy": "High-priority prospect. Friends of Hawaii Charities exists specifically to support Hawaii nonprofits. Apply for their programs, attend their events, seek an introduction to their board. Could provide direct funding, event sponsorship, or connect Hawaii FIDO to their donor network. Explore their Friends Club and Community programs for partnership opportunities."
    },
    {
      "handle": "combinedfederalcampaign",
      "display_name": "Combined Federal Campaign",
      "follower_count": 117,
      "bio": "Each fall, federal employees and retirees raise money and volunteer for their favorite charities through the Combined... \nmore\ngivecfc.org\nFollow\nMessage",
      "website": "givecfc.org",
      "hawaii_based": false,
      "reasoning_hawaii": "National federal program, not Hawaii-specific. The CFC operates nationwide with local zones.",
      "entity_type": "nonprofit",
      "reasoning_type": "The Combined Federal Campaign is the official workplace giving program for federal employees and retirees. Run by the U.S. Office of Personnel Management. Major charitable fundraising platform.",
      "capacity": "HIGH",
      "reasoning_capacity": "The CFC is one of the largest workplace giving programs in the world, raising hundreds of millions of dollars annually from federal employees. Has infrastructure for charitable giving, local zones, and established processes.",
      "alignment": "HIGH",
      "reasoning_alignment": "This is literally a charitable fundraising platform where federal employees donate to their favorite charities. Hawaii FIDO could be listed as a CFC charity, giving access to all federal employees in Hawaii (military, government workers).",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Professional organization with clear processes for charity participation. Website has sections for charities to apply. Approachable through formal channels.",
      "impact": "HIGH",
      "reasoning_impact": "Access to all federal employees and retirees through workplace giving. Hawaii has a massive federal/military workforce. One CFC listing = ongoing annual donations from potentially thousands of federal workers. Enormous multiplier effect.",
      "score": 82,
      "outreach_type": "DIRECT_FUNDING",
      "outreach_strategy": "High-priority prospect. Apply to become a listed CFC charity through givecfc.org. Hawaii has a massive federal and military workforce (Joint Base Pearl Harbor-Hickam, federal agencies). Being listed in the CFC means federal employees can make automatic payroll deductions to Hawaii FIDO. This is an ongoing annual revenue stream, not a one-time donation. Follow the CFC charity application process and ensure Hawaii FIDO meets eligibility requirements."
    },
    {
      "handle": "augietulba.hnl",
      "display_name": "Councilmember Augie Tulba",
      "follower_count": 5867,
      "bio": "Government Official\nOfficial Government Account for District 9 Councilmember Augie Tulba. Connect directly to Councilmember & Staff...\n530 south king st, Honolulu, Hawaii 96813\nlinktr.ee/augietulba.hnl",
      "website": "linktr.ee/augietulba.hnl",
      "hawaii_based": true,
      "reasoning_hawaii": "Honolulu City Council member, District 9. Explicit Honolulu address (530 S. King St). Government official for Honolulu.",
      "entity_type": "government",
      "reasoning_type": "City & County of Honolulu Councilmember for District 9. Official government account with legislative access, testimony submission, and community programs (Adopt a Park, Bike Safety, Ewa Convenience Center).",
      "capacity": "HIGH",
      "reasoning_capacity": "City council member with authority over municipal budget and policy. Can direct city resources, influence government programs, and advocate for legislation. High institutional capacity.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Government official with community service programs. Service dog accessibility is a potential policy issue (ADA compliance, public access). Council can influence disability-related policy.",
      "relationship": "HIGH",
      "reasoning_relationship": "Local government official who explicitly invites constituent engagement. Linktree includes newsletter signup, testimony submission, and direct contact. District 9 (Ewa) - accessible to constituents.",
      "impact": "HIGH",
      "reasoning_impact": "City council authority provides policy influence, government credibility, and access to city resources. Can advocate for service dog accessibility at council meetings, introduce resolutions, and open doors to government partnerships.",
      "score": 80,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "High-priority government outreach. Contact Councilmember Tulba's office to request a meeting about service dog accessibility in Honolulu. Propose a council resolution supporting service dog access, invite the councilmember to a FIDO event, and request advocacy at city council. Government endorsement provides enormous credibility and can unlock city resources."
    },
    {
      "handle": "808camo",
      "display_name": "CAMO",
      "follower_count": 924,
      "bio": "Healthcare Administrator\nCAMO\nComplementary & Alternative Medicine of Oahu\n501(c)(3)\n#808CAMO #Veterans #PTSD #CAM4PTSD #22ADay\n808camo.org and 1 more",
      "website": "808camo.org",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicitly 'Complementary & Alternative Medicine of Oahu.' 808 area code in handle. Oahu-based 501(c)(3) nonprofit.",
      "entity_type": "nonprofit",
      "reasoning_type": "501(c)(3) nonprofit organization focused on complementary and alternative medicine for veterans with PTSD on Oahu. Healthcare-focused charity.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Registered 501(c)(3) nonprofit with organizational structure. As a nonprofit, has grant-seeking experience and donor networks. However, as a service-providing nonprofit, their own resources may be limited.",
      "alignment": "HIGH",
      "reasoning_alignment": "Veterans with PTSD are among the primary beneficiaries of service dogs. The connection between PTSD treatment and service dogs is direct and well-documented. This nonprofit serves exactly the population that benefits most from service dogs. #22ADay references veteran suicide prevention.",
      "relationship": "HIGH",
      "reasoning_relationship": "Oahu-based 501(c)(3) nonprofit. Nonprofits are naturally collaborative. Shared mission overlap with veterans/PTSD creates strong basis for partnership. Has organizational contact through website.",
      "impact": "HIGH",
      "reasoning_impact": "Connects to veteran community on Oahu - a population that directly benefits from service dogs. Can refer veterans to Hawaii FIDO for service dogs. Partnership creates credibility in veteran services space. Access to veteran networks, VA resources, and veteran-focused donors.",
      "score": 80,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Highly aligned nonprofit serving veterans with PTSD on Oahu. PTSD service dogs are a core service dog application. Propose formal partnership: cross-refer veterans who could benefit from service dogs, co-host events combining alternative medicine and service dog therapy, joint grant applications for veteran service dog programs. CAMO's veteran network directly connects to Hawaii FIDO's potential service dog recipients. Could also co-develop a veteran-focused service dog program."
    },
    {
      "handle": "hawaiianelectric",
      "display_name": "Hawaiian Electric",
      "follower_count": 33400,
      "bio": "Established in 1891, we are committed to empowering our customers and communities by providing affordable, reliable...\nlinktr.ee/hwnelectric",
      "website": "linktr.ee/hwnelectric",
      "hawaii_based": true,
      "reasoning_hawaii": "Major Hawaii utility company. Bio references 'Hawaiian Electric serves 95 percent of Hawaii's 1.4 million residents on the islands of Oahu, Maui, Hawaii, Lanai and Molokai.' Established 1891.",
      "entity_type": "corporation",
      "reasoning_type": "Major utility corporation serving 95% of Hawaii's population. Established in 1891 with massive infrastructure and employee base across multiple islands.",
      "capacity": "HIGH",
      "reasoning_capacity": "Major corporation established 1891, serves 95% of Hawaii residents across 5 islands. Significant corporate resources, CSR budget expected. One of Hawaii's largest employers and institutions.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Community-focused corporation with CSR programs likely. No direct pet or disability focus but strong Hawaii community commitment. Website references community programs.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Professional corporate entity reachable via CSR department. Has established community engagement programs. Large but approachable through proper channels.",
      "impact": "HIGH",
      "reasoning_impact": "One of Hawaii's most iconic institutions. Association provides enormous credibility. Can open doors to corporate partnerships, employee giving programs, and community sponsorships.",
      "score": 78,
      "outreach_type": "DIRECT_FUNDING",
      "outreach_strategy": "Target CSR/community relations department for corporate sponsorship. Hawaiian Electric has 130+ year history of community investment. Propose sponsorship of a specific FIDO program (e.g., 'Hawaiian Electric Service Dog Scholarship'). Approach via formal corporate giving application."
    },
    {
      "handle": "aimeebchung",
      "display_name": "Aimee Chung",
      "follower_count": 842,
      "bio": "Nature lover, Universe worshiper, Faculty @ Thompson School at UHM #iamasocialworker 🏡 Honolulu, HI 🤙...\nmore\naimees-linkinbio.mypagecloud.com and 2 more",
      "website": "aimees-linkinbio.mypagecloud.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'Honolulu, HI.' Faculty at Thompson School at UHM (University of Hawaii at Manoa). Website confirms UHM Faculty Page and multiple Hawaii-based resources.",
      "entity_type": "professional",
      "reasoning_type": "University faculty member at Thompson School of Social Work at University of Hawaii at Manoa. Licensed social worker with focus on trauma-informed care, mental health, and domestic violence.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "University faculty member with professional income and institutional connections. Has connections to Domestic Violence Action Center, Hawaii Mental Health Workforce Accelerator Program, and Maui Strong resources. Institutional affiliation provides credibility and network access.",
      "alignment": "HIGH",
      "reasoning_alignment": "Social worker specializing in trauma-informed care directly connects to service dog applications for PTSD, trauma recovery, and mental health. Website shows involvement with Domestic Violence Action Center and mental health workforce. Service dogs serve populations this professor studies and advocates for.",
      "relationship": "HIGH",
      "reasoning_relationship": "Honolulu-based university faculty member. Social workers are naturally collaborative and community-oriented. Accessible through UHM, has multiple online links for contact. Active on social media (1871 posts).",
      "impact": "HIGH",
      "reasoning_impact": "University faculty can provide academic credibility, research partnerships, student volunteers, and access to UHM's broader network. Social work connections reach vulnerable populations who benefit from service dogs. Can influence future social workers' understanding of service dog therapy. Domestic Violence Action Center connection opens doors to DV survivor community.",
      "score": 78,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-value academic and social work connection. Approach through UHM Thompson School of Social Work for a multi-faceted partnership: (1) Guest lecture about service dogs in social work practice, (2) Research collaboration on service dog impact for trauma survivors, (3) Student practicum placements with Hawaii FIDO, (4) Connection to DVAC for service dogs for domestic violence survivors, (5) Mental health workforce training on service dog referrals. Her trauma-informed care expertise directly connects to service dog therapy applications."
    },
    {
      "handle": "mfastenau",
      "display_name": "Mary Fastenau",
      "follower_count": 785,
      "bio": "Retired marketing nerd in Honolulu. Writing the next chapter of my life in retirement. Can't wait to see what is next.\nwww.anthologygroup.com",
      "website": "www.anthologygroup.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'in Honolulu.' Website is Anthology Marketing Group, a major Hawaii marketing firm ('Making waves since 2007' with clients including Hawaii Visitors and Convention Bureau). Clearly Honolulu-based.",
      "entity_type": "professional",
      "reasoning_type": "Retired marketing executive in Honolulu. Connected to Anthology Marketing Group, a major Hawaii marketing firm. Highlights include 'Therapy dog' suggesting personal connection to therapy/service dogs.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Retired marketing executive from a major Hawaii marketing firm (Anthology Group works with Hawaii Visitors and Convention Bureau and other major clients). Has professional network, industry knowledge, and potential personal resources from career in marketing.",
      "alignment": "HIGH",
      "reasoning_alignment": "Has a 'Therapy dog' highlight indicating personal involvement with therapy dogs. This is direct alignment with Hawaii FIDO's service dog mission. Marketing expertise is also highly valuable for nonprofit awareness campaigns.",
      "relationship": "HIGH",
      "reasoning_relationship": "Honolulu-based retired professional. Retired individuals often have time and interest in community causes. Therapy dog highlight shows existing engagement with the service/therapy dog world. Connected to major marketing firm suggests broad professional network.",
      "impact": "HIGH",
      "reasoning_impact": "Connection to Anthology Marketing Group (major Hawaii marketing firm) provides potential door to pro-bono or reduced-rate marketing services. Marketing expertise can dramatically amplify Hawaii FIDO's reach. Professional network from career includes major Hawaii businesses and tourism industry. Retired means available time for volunteering or board service.",
      "score": 78,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Exceptional prospect. Retired Honolulu marketing executive with therapy dog interest and connections to Anthology Marketing Group (major Hawaii marketing firm). Multi-pronged approach: (1) Personal connection through therapy dog interest - she already cares about this space, (2) Ask for pro-bono marketing consultation or strategy for Hawaii FIDO, (3) Leverage her network at Anthology Group for potential corporate sponsorship or donated marketing services, (4) Explore board membership - retired professionals with marketing expertise and dog therapy interest are ideal nonprofit board candidates. Her combination of marketing expertise, Hawaii connections, retirement availability, and personal therapy dog interest makes her an outstanding prospect."
    },
    {
      "handle": "disabilityadvocateshi",
      "display_name": "Disability Advocates Hawaii",
      "follower_count": 547,
      "bio": "Local service\nWe believe in Educating + Advocating so that your voice can be heard\n💡Social Security Disability l SSI Claims l...\nwww.disabilityadvocatescenter.com",
      "website": "www.disabilityadvocatescenter.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Name explicitly includes 'Hawaii'. Handle includes 'hi'. Bio describes local service. Website confirms Hawaii focus.",
      "entity_type": "local_business",
      "reasoning_type": "Local service business focused on disability advocacy - specifically Social Security Disability and SSI claims. Professional advocacy/legal service.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established professional service business with website. Handles Social Security Disability and SSI claims, suggesting a functioning business with revenue. However, only 1 post on Instagram suggests early-stage social media or limited marketing investment.",
      "alignment": "HIGH",
      "reasoning_alignment": "Direct disability advocacy focus. Social Security Disability and SSI claims are exactly the population that would benefit from service dogs. 'Educating + Advocating so that your voice can be heard' aligns perfectly with service dog accessibility mission.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based disability service with professional presence (website, service model). As a disability advocacy business, they would understand and appreciate Hawaii FIDO's mission. Professional relationship is natural.",
      "impact": "HIGH",
      "reasoning_impact": "Direct access to Hawaii's disability community through their client base. Clients who are seeking SSI/SSDI are exactly the population who may need service dogs. Can refer clients, co-advocate, and provide credibility. Partnership creates a natural referral pipeline.",
      "score": 78,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "HIGH PRIORITY. Propose a referral partnership where Disability Advocates Hawaii can inform their clients about service dog options through Hawaii FIDO. Offer to provide educational materials about service dogs for their client interactions. This creates a natural referral pipeline - their clients seeking disability benefits are the same population that may benefit from service dogs. Co-host disability awareness events. Their advocacy credibility enhances Hawaii FIDO's legitimacy."
    },
    {
      "handle": "hawaiidisability",
      "display_name": "Hawaii Disability Legal Services",
      "follower_count": 351,
      "bio": "Lawyer & Law Firm\nWe help people throughout Hawaii, the Pacific Territories and other countries get Social Security & VA Disability...",
      "website": "www.hawaiidisabilitylegal.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Name is 'Hawaii Disability Legal Services'. Address: '1188 Bishop Street, 1402, Honolulu, Hawaii 96813'. Serves people throughout Hawaii.",
      "entity_type": "local_business",
      "reasoning_type": "Law firm specializing in Social Security and VA disability claims. Professional legal services for people with disabilities in Hawaii.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established law firm in Honolulu's financial district (Bishop Street). Professional office. Legal practices generate moderate to good revenue. Serves clients throughout Hawaii and Pacific Territories.",
      "alignment": "HIGH",
      "reasoning_alignment": "Disability-focused law firm with direct connection to Hawaii FIDO's mission. Clients are people with disabilities who may need or benefit from service dogs. Social Security and VA disability overlap significantly with the service dog community.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based disability-focused professional service. Natural alignment creates strong relationship potential. Professional firm with business account and messaging enabled.",
      "impact": "HIGH",
      "reasoning_impact": "Access to disability community throughout Hawaii. Clients are exactly the population that benefits from service dogs. Can refer clients to Hawaii FIDO. Connection to VA disability extends to veteran service dogs. Major multiplier through client referrals.",
      "score": 78,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority partnership prospect. Hawaii's disability law firm serves exactly the population that needs service dogs. Propose a referral partnership where they inform clients about service dog resources through Hawaii FIDO. Could sponsor events, provide pro-bono legal advice, or co-host disability awareness events. Their VA disability practice connects to veteran service dogs. Explore mutual client referral program."
    },
    {
      "handle": "aloha_k9_training",
      "display_name": "Aloha K9 Training | Service Dog Trainer",
      "follower_count": 3888,
      "bio": "Katie Jurgensen\nOahu, Hawai'i\nCertified Dog Trainer\nService Dog Training\nCertified @americankennelclub...\nlinktr.ee/alohak9",
      "website": "linktr.ee/alohak9",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit 'Oahu, Hawai'i' in bio. Handle includes 'aloha.' Service dog trainer based on Oahu.",
      "entity_type": "pet_industry",
      "reasoning_type": "Certified dog trainer specializing in service dog training on Oahu. AKC certified. Has highlights for service dogs, task training, scent training. Professional pet industry business.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual dog trainer. Small professional operation. Value is in expertise and partnership rather than financial capacity.",
      "alignment": "HIGH",
      "reasoning_alignment": "SERVICE DOG TRAINER on Oahu - the most direct possible alignment with FIDO's mission. Certified dog trainer specializing in service dog training. Exact mission match.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based service dog trainer. Most natural professional connection possible. Already in the service dog space on Oahu. Direct professional colleague.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Hawaii's service dog community. Can refer clients, co-train, and provide professional credibility. 3.9K followers in service dog niche.",
      "score": 75,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "HIGH PRIORITY partnership. Aloha K9 Training is a certified service dog trainer on Oahu - the most natural professional partner for FIDO. Propose training collaboration, client cross-referrals, co-hosted training workshops, and joint advocacy for service dog accessibility. This is an essential Hawaii service dog community relationship."
    },
    {
      "handle": "waikikicommunitycenter",
      "display_name": "Waikiki Community Center",
      "follower_count": 2557,
      "bio": "Community\nWaikiki hub for Community, Connection & Care. Events, Workshops & Activities. Support for Keiki to Kupuna. Preschool &...\n310 Paoakalani Ave, Honolulu, Hawaii 96815",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Physical address: 310 Paoakalani Ave, Honolulu, Hawaii 96815. Located in Waikiki, Oahu. Uses Hawaiian terms (Keiki, Kupuna).",
      "entity_type": "member_org",
      "reasoning_type": "Community center serving Waikiki area with events, workshops, activities, and preschool. Serves all ages (Keiki to Kupuna). Community gathering space and organization.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established community center with physical location in Waikiki, organized programming (events, workshops, preschool), serving broad community. Institutional operation with ongoing programs.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Community service orientation serving diverse needs including potentially disability services (support for Keiki to Kupuna). Community centers often host nonprofit events and awareness campaigns.",
      "relationship": "HIGH",
      "reasoning_relationship": "Public community center - inherently open to community partnerships. Physical venue in Waikiki. Programs designed for community engagement. High accessibility for collaboration.",
      "impact": "HIGH",
      "reasoning_impact": "Community center serves as hub for Waikiki community. Events reach diverse audiences. Physical venue can host presentations, fundraisers, or awareness events. Connection to local government and community services. One partnership = access to entire community center network.",
      "score": 75,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "High value venue and community partner. Request to host a Hawaii FIDO awareness event or workshop at the community center. Community centers regularly host nonprofit presentations. Could reach Waikiki residents, kupuna (who may benefit from service dogs), and keiki (educational programs). Venue partnership alone is valuable."
    },
    {
      "handle": "hotdogonaleash_honolulu",
      "display_name": "Hot Dog on A Leash Honolulu",
      "follower_count": 1260,
      "bio": "Dog Training & Behavior Specialist | Honolulu | Online Courses | www.hotdogonaleash.com",
      "website": "www.hotdogonaleash.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle includes 'honolulu'. Bio states 'Honolulu'. Display name includes 'Honolulu'. Website shows extensive local services.",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog training and behavior business in Honolulu. Offers board & train, boot camp, puppy training, obedience, behavioral consultation, personal protection, doggy day camp, scent training, SERVICE DOG TRAINING, surf class, and water play. Professional operation with franchise opportunities.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established dog training business with extensive service menu. Franchise opportunities suggest a scalable business model. Professional website with webcams, gallery, and structured programs. This is more than a solo trainer.",
      "alignment": "HIGH",
      "reasoning_alignment": "OFFERS SERVICE DOG TRAINING as one of their services. This is a direct, perfect alignment with FIDO's mission. Also offers behavioral consultation and multiple training programs. Shares the same space of service dog preparation.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based dog training business in Honolulu. Is a business account. Professional website with contact page. Service dog training offering means they already understand and operate in FIDO's space. Natural partner.",
      "impact": "MEDIUM",
      "reasoning_impact": "Established local dog training business with multiple service lines. Can refer clients directly to FIDO. Service dog training expertise provides credibility overlap. Franchise model suggests growth orientation. However, still a local business rather than an institution.",
      "score": 75,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority partnership. This business ALREADY OFFERS SERVICE DOG TRAINING - the most direct possible overlap with FIDO's mission. Propose a formal referral partnership, co-training programs, or shared service dog training protocols. Could become FIDO's recommended training partner for service dog handlers. Explore co-branded events, training workshops, and mutual referrals. This is a natural, strategic alliance."
    },
    {
      "handle": "alohailhawaii",
      "display_name": "AlohaIndependentLivingHawaii",
      "follower_count": 269,
      "bio": "Nonprofit organization\nGrassroots non-profit organization whose mission is to provide independent living programs and services for persons with...",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Name is 'Aloha Independent Living Hawaii'. Zip code 96782 (Pearl City, Hawaii). Hawaii is in the organization name.",
      "entity_type": "nonprofit",
      "reasoning_type": "Grassroots nonprofit providing independent living programs and services for persons with disabilities. Has outreach programs, consumer programs, and fundraising initiatives.",
      "capacity": "LOW",
      "reasoning_capacity": "Grassroots nonprofit that is itself a small organization needing funding. 269 followers. Uses AmazonSmile and Give Aloha for fundraising. Small-scale operation.",
      "alignment": "HIGH",
      "reasoning_alignment": "Independent living services for persons with disabilities - extremely high alignment with service dogs. Service dogs directly enable independent living. This organization serves exactly the population that Hawaii FIDO aims to help. Direct mission overlap.",
      "relationship": "HIGH",
      "reasoning_relationship": "Fellow Hawaii nonprofit serving people with disabilities. Natural ally. Has outreach programs and consumer services suggesting community engagement. Very receptive to collaboration with aligned organizations.",
      "impact": "HIGH",
      "reasoning_impact": "Direct access to people with disabilities who could benefit from service dogs. Grassroots community connections to the disability community. Can refer clients to Hawaii FIDO. Despite small size, the alignment makes every referral high-value.",
      "score": 75,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-priority partnership prospect. Aloha Independent Living Hawaii serves exactly the population that benefits from service dogs. Propose a formal referral partnership where they connect clients with Hawaii FIDO for service dog assessments. Co-host disability awareness events. Cross-promote through their outreach programs. This is a strategic alliance - they have the clients, Hawaii FIDO has the service dogs."
    },
    {
      "handle": "thepublicpet",
      "display_name": "THE PUBLIC PET",
      "follower_count": 15500,
      "bio": "Pet Supplies\nURBAN PET SUPPLY for CATS & DOGS\nOpen TUE-SUN 9-6p / Closed MONDAYS\n3422 Waialae Ave, Honolulu, Hawaii 96816\nlinktr.ee/thepublicpet",
      "website": "linktr.ee/thepublicpet",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit Honolulu, Hawaii address (3422 Waialae Ave, Kaimuki, 96816). Website confirms 'urban pet supply store located in Kaimuki, Hawaii.'",
      "entity_type": "pet_industry",
      "reasoning_type": "Pet supply store in Kaimuki, Honolulu. Specializes in high quality and organic pet products for cats and dogs. Has online store and physical location. Also participated in Maui fire relief ('Help Maui Rise').",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established local pet store with physical location, regular business hours, online store, and community involvement (Maui fire relief). Moderate business resources.",
      "alignment": "HIGH",
      "reasoning_alignment": "Pet industry business directly serving dog and cat owners. Community-minded (Maui fire relief). Shared customer base with FIDO - dog owners who care about pet welfare.",
      "relationship": "HIGH",
      "reasoning_relationship": "Local Hawaii pet business, community-engaged (Maui relief), hosts events (PAW HANA, SURFUR). Physical store provides natural touchpoint. Open to community partnerships.",
      "impact": "MEDIUM",
      "reasoning_impact": "15.5K followers in Hawaii pet community. Can display FIDO materials, host adoption/awareness events, and connect with local dog owner network. Pet store is natural partner.",
      "score": 72,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a natural partnership. The Public Pet is a community-minded pet store in Kaimuki that already supports local causes (Maui fire relief). Propose in-store FIDO awareness materials, co-hosted events (like their PAW HANA events), and cross-promotion. Could also explore product donation or fundraising percentage days."
    },
    {
      "handle": "its_ben_awhile1",
      "display_name": "Ben Bryce",
      "follower_count": 2694,
      "bio": "Art Consultant\nReal Estate Investor\nPuppy Raiser\nLanc-->Nash-->SD-->Oahu",
      "website": "www.benjaminrbryce.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio shows location path ending in 'Oahu' as current location. Website confirms: Naval Officer, Writer, Art Consultant based on Oahu.",
      "entity_type": "professional",
      "reasoning_type": "Multi-faceted professional: Naval Officer, Art Consultant, Real Estate Investor, and Puppy Raiser. Currently on Oahu.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Real estate investor and art consultant with professional website. Naval officer suggests stable income. Multiple professional roles indicate moderate-to-good financial capacity.",
      "alignment": "HIGH",
      "reasoning_alignment": "PUPPY RAISER is a direct service dog connection. Puppy raisers raise puppies for service dog organizations. Bio highlights show multiple dog names (Summit, Boomer, Molly, Sky, Wesson, Mikey, Clifton, George, Gus) suggesting extensive puppy raising history.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based professional with direct puppy raising experience. Naval officer community on Oahu is significant. Art consultant role suggests broad professional network. Very approachable - lists multiple interests and has professional website.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to military community on Oahu (major population), art world, and real estate. Puppy raising experience gives credibility in service dog space. Multiple dogs raised suggests long-term commitment.",
      "score": 72,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-value connection. Puppy raiser with extensive experience (9+ dogs in highlights). Approach as fellow service dog community member. Could be a puppy raiser for Hawaii FIDO, ambassador to military community on Oahu, or connector to art world for fundraising events. Naval officer connection opens doors to military community which has high service dog need."
    },
    {
      "handle": "haikuvet",
      "display_name": "Haiku Veterinary Clinic",
      "follower_count": 1003,
      "bio": "Community\nProviding life long care for your pet🐾\n📍Located on the beautiful Windward side of Oahu, HI\ninfo@haikuvet.com | (808)...\nmore\n45-773 Kamehameha Hwy, Kaneohe, Hawaii 96744\nwww.kaneohevets.com",
      "website": "www.kaneohevets.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit Hawaii address: '45-773 Kamehameha Hwy, Kaneohe, Hawaii 96744.' Located on Windward side of Oahu. 808 area code. Website is kaneohevets.com.",
      "entity_type": "pet_industry",
      "reasoning_type": "Veterinary clinic in Kaneohe, Hawaii. Professional animal healthcare provider with physical location, staff, and established services including wellness, vaccinations, allergy treatment, pet travel, and more.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established veterinary clinic with physical location, professional website, multiple services (wellness, vaccinations, ozone therapy, cold laser therapy, nutrition). Has business infrastructure and ongoing revenue from pet healthcare.",
      "alignment": "HIGH",
      "reasoning_alignment": "Veterinary clinic directly serves the pet/animal community. Would understand and appreciate service dog importance. Shared customer base with Hawaii FIDO - service dog handlers need veterinary care. Direct mission alignment with animal welfare.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based veterinary clinic on Windward Oahu. Professional business with contact info, email, and physical location. Pet industry businesses are naturally inclined to partner with service dog organizations.",
      "impact": "MEDIUM",
      "reasoning_impact": "Vet clinics interact with hundreds of pet owners. Can display Hawaii FIDO materials, refer clients, and provide professional credibility. However, impact is limited to their client base rather than broader institutional network.",
      "score": 72,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Excellent pet industry partner. Approach with partnership proposal: display Hawaii FIDO brochures in clinic, offer discounted vet services for service dogs in training, co-host pet health events. The clinic's Windward Oahu location serves a community that likely includes service dog handlers. Could also provide medical expertise and professional endorsement for Hawaii FIDO's service dog program."
    },
    {
      "handle": "iadaorg",
      "display_name": "International Assistance Dog Alliance",
      "follower_count": 670,
      "bio": "International Assistance Dog Alliance (IADA) Expanding Access, Elevating Standards. 501(c)(4) Non Profit advancing...",
      "website": "www.iadaorg.com",
      "hawaii_based": false,
      "reasoning_hawaii": "International organization. Website shows no Hawaii-specific location. No Hawaii references in bio or website content.",
      "entity_type": "nonprofit",
      "reasoning_type": "501(c)(4) nonprofit focused on assistance dog standards, training, evaluation, and certification. Professional organization for the assistance dog industry.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established 501(c)(4) nonprofit with professional website. Has board members, membership structure, and certification programs. However, as a standards/advocacy org, their direct funding capacity for external organizations may be limited.",
      "alignment": "HIGH",
      "reasoning_alignment": "Directly focused on assistance dogs - training, evaluation, certification, and expanding access. Perfect mission alignment with Hawaii FIDO's service dog work. Website mentions 'Expanding Access, Elevating Standards.'",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Professional organization with membership structure. Website shows board, members, and contact info. Open to professional relationships in the assistance dog field.",
      "impact": "HIGH",
      "reasoning_impact": "As a national/international assistance dog alliance, could provide credibility, certification pathways, networking with other assistance dog organizations, and professional standards guidance. Membership connection opens doors to entire assistance dog industry.",
      "score": 72,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Pursue professional partnership and potential membership. IADA could provide Hawaii FIDO with certification standards, professional credibility, and network access to the broader assistance dog community. Approach as a peer organization seeking to align with IADA standards and join their network. Could also explore IADA membership for Hawaii FIDO trainers."
    },
    {
      "handle": "hawaiidoggiebakery",
      "display_name": "Hawaii Doggie Bakery",
      "follower_count": 9755,
      "bio": "Pet Service\nHawaii's 1st dog bakery founded in 1998\nClosed Tuesdays, open all other days\n10am-3pm\nCall/Text, no DMs\n2961C East Manoa Rd, Honolulu, Hawaii 96822\nshop.hawaiidoggiebakery.org",
      "website": "shop.hawaiidoggiebakery.org",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit Honolulu, Hawaii address (Manoa). Named 'Hawaii Doggie Bakery.' Self-described as 'Hawaii's 1st dog bakery.' Founded 1998.",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog bakery business in Honolulu, Hawaii's first since 1998. Physical store with online shop. Specializes in dog treats with birthday offerings, same-day pickup, and shipping.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established pet business since 1998 (27+ years). Physical location in Manoa, online store, regular hours. Longevity indicates stability. Small but established local business.",
      "alignment": "HIGH",
      "reasoning_alignment": "Direct pet industry alignment - dog bakery serves dog owners, the same community FIDO serves. 27+ years in Hawaii's dog community means deep relationships and shared customer base.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii's first dog bakery with 27 years of local relationships. Physical store is community touchpoint. Established in Manoa, a strong local community. Verified business.",
      "impact": "MEDIUM",
      "reasoning_impact": "Deep roots in Hawaii's dog owner community since 1998. Can provide product donations, in-store promotion, and connect FIDO with their extensive local dog owner network. 9.7K engaged followers.",
      "score": 70,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a natural partner. Hawaii Doggie Bakery has served the local dog community for 27 years. Propose in-store FIDO materials, co-branded treats for fundraising, donation percentage days, and joint events. Their deep community roots make them an excellent grassroots partner for reaching dog owners."
    },
    {
      "handle": "oahudogtraining",
      "display_name": "O'ahu Dog Training | Kristen Davis, Ph.D.",
      "follower_count": 2311,
      "bio": "O'ahu's Original Concierge Dog Trainer - Redefining what's possible when balanced training meets real life.",
      "website": "www.oahudogtraining.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Display name includes 'O'ahu', bio states 'O'ahu's Original Concierge Dog Trainer'. Website is oahudogtraining.com.",
      "entity_type": "pet_industry",
      "reasoning_type": "Professional dog training business on Oahu. Owner has Ph.D. Concierge-style (in-home/personalized) dog training. Established brand ('Original').",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Professional dog trainer with Ph.D., dedicated website, established brand. Concierge service model suggests premium pricing and professional operation. 570 posts showing consistent presence.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dog training is directly aligned with service dog training mission. Ph.D.-level expertise adds scientific credibility. 'Balanced training' and 'redefining what's possible' suggests progressive training philosophy aligned with modern service dog training approaches.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based professional dog trainer. Accessible via website, DM. Professional who would understand and value service dog work. Ph.D. adds academic network connection.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Oahu dog owner community. Ph.D. credentialing could lend academic credibility to Hawaii FIDO programs. Professional training expertise is directly useful. Could train or consult on service dog programs.",
      "score": 70,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Strong partnership candidate. Propose training collaboration: could serve as trainer or consultant for Hawaii FIDO's service dog program, co-host educational events, or refer clients to Hawaii FIDO. Ph.D. expertise adds scientific credibility. 'Concierge' model suggests flexibility for customized partnerships."
    },
    {
      "handle": "twogemkennels",
      "display_name": "TwoGems",
      "follower_count": 952,
      "bio": "American Bulldogs and English Labradors in Hawai'i. #twogemkennels\nFollow\nLuna\nRescues\nPounamu x Otis\nService dogs\nTennessee\nOtis\nPounamu\nHomestead\nMatau\nHorsing Around",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'in Hawaiʻi.' Breeding American Bulldogs and English Labradors in Hawaii.",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog kennel/breeder in Hawaii. Breeds American Bulldogs and English Labradors. Highlights include 'Service dogs' and 'Rescues' indicating involvement beyond just breeding.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established kennel with 1718 posts suggesting longevity and active operation. Breeding operation generates revenue. Multiple dogs and highlights suggest established business, though likely small-scale.",
      "alignment": "HIGH",
      "reasoning_alignment": "Highlight specifically mentions 'Service dogs' - directly involved in service dog breeding/training. Also involved in 'Rescues.' English Labradors are a common service dog breed. Direct mission overlap with Hawaii FIDO.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based dog breeder with explicit service dog involvement. Would have immediate understanding of and interest in Hawaii FIDO's mission. Industry peer relationship potential.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Hawaii's dog breeding community and service dog network. Can provide referrals, breeding expertise, and connections to service dog community. 1718 posts show active engagement. However, limited institutional reach beyond pet community.",
      "score": 70,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "High-alignment Hawaii-based kennel with direct service dog involvement. Approach as a potential breeding/training partner. TwoGems could provide puppies or breeding stock for Hawaii FIDO's service dog program. Discuss collaboration on service dog breeding, co-promotion, and referrals. Their experience with English Labradors (prime service dog breed) and explicit service dog highlights make them a natural partner. Could also connect Hawaii FIDO to the broader Hawaii dog breeding and rescue network."
    },
    {
      "handle": "hawaiipetrehab",
      "display_name": "Hawaii Pet Rehabilitation",
      "follower_count": 851,
      "bio": "🐾A holistic approach to dogs, cats and other small critters.\n🌿And all things fun about it\nhawaiipetrehab.com",
      "website": "hawaiipetrehab.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle is 'hawaiipetrehab' and business name is 'Hawaii Pet Rehabilitation.' Website confirms Hawaii location with services including dog walking/sitting, various therapies (ozone, cold laser, infrared), canine/feline nutrition, preventative care, and physical rehabilitation.",
      "entity_type": "pet_industry",
      "reasoning_type": "Pet rehabilitation and holistic care business in Hawaii. Offers multiple services including physical rehabilitation, various therapies, nutrition, dog walking, and preventative care.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established pet rehabilitation business with professional website and multiple service offerings. Physical therapy equipment and specialized services suggest real business investment. However, holistic/alternative focus suggests smaller-scale operation.",
      "alignment": "HIGH",
      "reasoning_alignment": "Pet rehabilitation directly overlaps with service dog care. Service dogs need physical rehabilitation, preventative care, and wellness services. The holistic approach to pet health aligns with maintaining service dog fitness and health. Direct shared customer base.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based pet rehabilitation business. Professional website with services that directly serve service dog needs. Natural partnership fit. Has website and contact for outreach.",
      "impact": "MEDIUM",
      "reasoning_impact": "Interacts with pet owners who care deeply about animal health. Can refer clients to Hawaii FIDO and provide rehabilitation services for service dogs. However, limited to their client base for broader reach.",
      "score": 70,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Excellent partnership prospect. Hawaii Pet Rehabilitation's services (physical rehab, cold laser therapy, nutrition) directly benefit service dogs. Propose discounted or donated rehabilitation services for Hawaii FIDO's service dogs in training. They could become the official rehab partner. Cross-referral arrangement: they refer clients to Hawaii FIDO, Hawaii FIDO refers service dogs for rehab. Potential for co-hosted educational events on service dog health and wellness."
    },
    {
      "handle": "fureverfriendshi",
      "display_name": "Furever Friends Play And Stay",
      "follower_count": 4633,
      "bio": "Pet Service\nUnleashing great service\nDoggy Daycare + Boarding\nCat Boarding\n686 Ahua Street, Honolulu, Hawaii 96819\nwww.fureverfriendshi.com",
      "website": "www.fureverfriendshi.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit Honolulu, Hawaii address (686 Ahua Street, 96819). Handle ends in 'hi' for Hawaii. Website confirms Honolulu location.",
      "entity_type": "pet_industry",
      "reasoning_type": "Pet daycare and boarding facility in Honolulu. Offers doggy daycare, boarding, cat boarding, extra services, birthday events, and grooming. Physical facility with multiple services.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established pet service facility with physical location, multiple service offerings (daycare, boarding, grooming, birthdays), website, and regular operations. Moderate business resources.",
      "alignment": "HIGH",
      "reasoning_alignment": "Pet service business serving dog and cat owners in Honolulu. Direct customer base overlap with FIDO - dog owners who invest in pet care. Daily interaction with pet owners.",
      "relationship": "HIGH",
      "reasoning_relationship": "Local Hawaii pet business with physical facility. Interacts daily with dog owners. Could host events, display materials, and connect with pet-owning customers. Community-oriented pet service.",
      "impact": "MEDIUM",
      "reasoning_impact": "Regular contact with dog owners through daycare and boarding services. Physical facility could host FIDO events. 4.6K local followers. Can distribute FIDO information to daily customers.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a pet industry partner. Furever Friends interacts daily with dog owners who invest in pet care - FIDO's target audience. Propose in-facility FIDO awareness materials, co-hosted events, and cross-referrals. Their facility could host FIDO training demonstrations or awareness events."
    },
    {
      "handle": "kamaainak9",
      "display_name": "Kama'aina K9 Adventures",
      "follower_count": 3849,
      "bio": "Run.Sniff.Splash.Explore.\nDog Daycare / Dog Boarding\nGroup Play / Private Play\n94-1100 Kunia Rd, Waipahu, Hawaii 96797\nhawaiidoggiedaycare.com",
      "website": "hawaiidoggiedaycare.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit Waipahu, Hawaii address. 'Kama'aina' is Hawaiian word. Website is 'hawaiidoggiedaycare.com.' Handle includes Hawaiian language. Self-described as 'Hawaii's First Doggie Theme Park.'",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog daycare and boarding facility in Waipahu, Oahu. 'Hawaii's First Doggie Theme Park.' Services include daycare, extended care, private play, and grooming. Has facility, staff, and careers page.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established pet facility with physical location, multiple services, staff, and professional website. 'Hawaii's First Doggie Theme Park' branding suggests established market position.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dog care facility serving Hawaii dog owners daily. Direct customer base overlap with FIDO. Dogs and their owners are the core business - shared community.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based pet business with physical facility, daily dog owner interactions, and community presence. Natural partner for a dog-focused nonprofit.",
      "impact": "MEDIUM",
      "reasoning_impact": "Daily contact with dog owners through daycare and boarding. Physical facility for events. 3.8K local followers. Can distribute FIDO information to regular customers.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a pet industry partner. Kama'aina K9 Adventures interacts daily with committed dog owners. Propose in-facility FIDO materials, a 'Doggie Theme Park Day' benefiting FIDO, and cross-promotion. Their fun, community-oriented brand ('Run.Sniff.Splash.Explore') could create engaging fundraising events."
    },
    {
      "handle": "doggyboxhawaii",
      "display_name": "Doggy Box Grooming Salon",
      "follower_count": 1407,
      "bio": "ALOHA Full service Dog Grooming\n10th ANN MAHALO for all support!\nOPEN Tue + Wed + Fri + Sat: 8~5pm\n856 Ilaniwai...",
      "website": "doggyboxhawaii.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle includes 'hawaii'. Uses 'ALOHA' and 'MAHALO'. Physical address listed on Ilaniwai street (Honolulu). Celebrating 10th anniversary in Hawaii.",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog grooming salon in Honolulu. Full-service grooming business with physical location, celebrating 10th anniversary.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established dog grooming business celebrating 10th anniversary. Has physical location, website with grooming packages and e-commerce. Brick-and-mortar pet business with decade of operation suggests stability.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dog grooming salon directly in the pet industry. Serves dog owners who may also be service dog handlers. 'ALOHA' greeting and 'MAHALO' show community spirit. Direct overlap with FIDO's dog-loving audience.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based pet business with 10 years of community presence. Physical location for events/promotions. Dog business would naturally be receptive to service dog nonprofit. Participated in Hawaii Pet Expo per highlights.",
      "impact": "MEDIUM",
      "reasoning_impact": "Established local pet business with client base of dog owners. Hawaii Pet Expo participation shows industry connections. Can refer clients and display materials, but limited broader reach beyond pet community.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Natural partnership opportunity. Propose displaying FIDO brochures/donation jars in the salon. Could co-host a grooming event where portion of proceeds goes to FIDO. Their 10-year anniversary and Hawaii Pet Expo involvement show strong community ties. Approach with partnership framing - they serve dog owners who care about dogs."
    },
    {
      "handle": "weenqween",
      "display_name": "Dr. Baye Williamson",
      "follower_count": 1301,
      "bio": "Veterinarian\nUTCVM 2012\nVeterinary Neurosurgeon @verc.hawaii @ethosvethealth @vetspecialists @utcvm @the_acvim",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Tags @verc.hawaii (Veterinary Emergency + Referral Center of Hawaii). 'VERC Neuro' and 'VERC' in highlights confirm Hawaii veterinary practice.",
      "entity_type": "professional",
      "reasoning_type": "Veterinary neurosurgeon at VERC Hawaii. Specialized veterinary professional with advanced surgical expertise. UTCVM (University of Tennessee College of Veterinary Medicine) graduate.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Veterinary neurosurgeon is a highly specialized and well-compensated profession. Works at an established veterinary hospital (VERC Hawaii). However, individual professional rather than business owner.",
      "alignment": "HIGH",
      "reasoning_alignment": "Veterinarian directly in the animal health field. Works with dogs professionally. Veterinary neurosurgery connects to the health and welfare of service dogs. Professional understanding of service dog health needs.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based veterinary professional at a major vet center. Professional contact through VERC Hawaii. Would immediately understand and appreciate FIDO's mission. Published researcher (NIH article linked).",
      "impact": "MEDIUM",
      "reasoning_impact": "Respected veterinary professional in Hawaii. Can refer clients, provide veterinary guidance, and lend professional credibility. VERC Hawaii connection provides access to the veterinary professional network. However, individual rather than organizational impact.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a veterinary professional partner. Propose veterinary advisory role for FIDO's service dogs, or discounted/pro-bono neurological consultations for service dogs. Dr. Williamson's expertise and VERC Hawaii affiliation lend credibility. Could also participate in educational events about service dog health."
    },
    {
      "handle": "wagandlearn",
      "display_name": "Julie Ho, CPDT-KA",
      "follower_count": 515,
      "bio": "Twenty five years dog training & coaching families using positive ways. Group classes, private lessons &...\nwww.wagandlearninc.com",
      "website": "www.wagandlearninc.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Website and business name suggest local Hawaii operation. 'Wag and Learn Inc.' is a Hawaii-based dog training business. CPDT-KA is a certified professional dog trainer credential.",
      "entity_type": "pet_industry",
      "reasoning_type": "Professional dog trainer with 25 years experience. CPDT-KA certified. Offers group classes and private lessons. Incorporated business (Inc.).",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established business with 25 years of operation, professional certification (CPDT-KA), website, and incorporated status. Long-standing local business with stable revenue from training services.",
      "alignment": "HIGH",
      "reasoning_alignment": "Professional dog trainer using 'positive ways' - directly aligned with service dog training methodology. 25 years of experience coaching families with dogs. Understands dog behavior, training standards, and the human-dog bond at a professional level.",
      "relationship": "HIGH",
      "reasoning_relationship": "Long-established local dog training professional. Has a client base of dog-owning families. Professional credibility (CPDT-KA). Website and business infrastructure suggest approachability.",
      "impact": "MEDIUM",
      "reasoning_impact": "Access to a client base of dog-owning families who invest in professional training. Can refer clients, co-train, or provide professional endorsement. 25 years of local reputation is valuable. However, individual business limits scale of multiplier effect.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Strong prospect for professional partnership. Julie Ho's 25 years of CPDT-KA certified dog training experience makes her a natural ally. Propose collaboration on service dog awareness workshops, joint training events, or professional referral network. She could train Hawaii FIDO volunteers, refer clients to service dog programs, or co-host educational events. Her professional endorsement carries weight in the local dog training community."
    },
    {
      "handle": "islandveterinarycare",
      "display_name": "Island Veterinary Care",
      "follower_count": 289,
      "bio": "Veterinarian\n\"Caring hearts, healing hands.\"\nWe take the extra time with you and your pet. Elevating the standard of care one pet at...",
      "website": "www.islandveterinarycare.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Address: '830 Coolidge St, Honolulu, Hawaii 96826'. Phone: 808-944-0003. Website confirms Honolulu, HI location.",
      "entity_type": "pet_industry",
      "reasoning_type": "Veterinary practice in Honolulu with multiple veterinarians (Dr. Bert Lau, Dr. Rachael Lau, Dr. Ednee Yoshioka). Full-service veterinary hospital with advanced capabilities including CT, acupuncture, dental, laser therapy.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established multi-doctor veterinary practice with advanced services (CT scanning, acupuncture, laser therapy, internal medicine). Professional website, physical location on Coolidge St in Honolulu. Moderate to good revenue for a multi-vet practice.",
      "alignment": "HIGH",
      "reasoning_alignment": "Veterinary practice directly serves the animal health community. Service dogs require regular veterinary care. Natural alignment with Hawaii FIDO's mission through animal health and welfare.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based veterinary practice with multiple doctors. Professional business with messaging enabled. Healthcare providers for dogs including potential service dogs. Very accessible and natural connection.",
      "impact": "MEDIUM",
      "reasoning_impact": "Access to a broad base of pet owners in Honolulu. Can refer service dog candidates and provide medical support. Professional credibility in the animal health community. Multiple vets expand influence.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Strong partnership prospect. Multi-doctor veterinary practice that could provide discounted or pro-bono veterinary services for service dogs in training. Could display Hawaii FIDO materials in waiting room, refer clients interested in service dogs, and provide medical evaluations for service dog candidates. Explore a veterinary care partnership agreement."
    },
    {
      "handle": "waipiopetclinic",
      "display_name": "Waipio Pet Clinic",
      "follower_count": 232,
      "bio": "Veterinarian\nDedicated animal lovers 🦮🐈\n⏰M-F 8:00-600 SAT 8:00-12:00\n📞 808 676-2205\n🏥94-1040 waipio uka street #8\nwww.gwpetclinic.com\nFollow\nMessage\n🫶🫶🫶",
      "website": "www.gwpetclinic.com",
      "hawaii_based": true,
      "reasoning_hawaii": "808 area code, Waipio Uka Street address, Waipahu HI 96797 confirmed on website. Clearly Hawaii/Oahu-based veterinary clinic.",
      "entity_type": "pet_industry",
      "reasoning_type": "Veterinary clinic providing pet medical services. Established local business with physical location, hours, and professional website.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established veterinary clinic with physical location, regular business hours (M-F + Sat), professional website, and staff. Moderate business resources as a local vet practice.",
      "alignment": "HIGH",
      "reasoning_alignment": "Veterinary clinic with 'dedicated animal lovers' in bio. Uses service dog emoji (🦮). Direct overlap with service dog health needs and animal welfare mission.",
      "relationship": "HIGH",
      "reasoning_relationship": "Local Hawaii business with physical address, phone number, and professional online presence. Veterinary clinics regularly partner with animal welfare organizations. Highly approachable.",
      "impact": "MEDIUM",
      "reasoning_impact": "Access to pet owner community and local animal welfare network. Can refer clients and potentially provide pro-bono veterinary services. Limited broader network beyond pet community.",
      "score": 68,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a partnership opportunity. Propose pro-bono or discounted veterinary services for FIDO service dogs in exchange for recognition. Could host informational materials in waiting room and refer clients. Contact via phone (808-676-2205) or visit in person at Waipio location."
    },
    {
      "handle": "sonyopenhawaii",
      "display_name": "Sony Open in Hawaii",
      "follower_count": 11900,
      "bio": "Official account for the Sony Open in Hawaii, January 12-18, 2026 at Waialae Country Club, Oahu\n4997 Kahala Ave, Honolulu, Hawaii 96813\nwww.sonyopeninhawaii.com",
      "website": "www.sonyopeninhawaii.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Major annual PGA golf event in Hawaii. Held at Waialae Country Club, Oahu. Explicit Honolulu address. Website shows extensive Hawaii community engagement.",
      "entity_type": "corporation",
      "reasoning_type": "Major corporate-sponsored sporting event (Sony + PGA Tour). Has sponsorship tiers, volunteer programs, military outreach, and community engagement. Backed by Sony and connected to wealthy golf community.",
      "capacity": "HIGH",
      "reasoning_capacity": "Backed by Sony Corporation with major corporate sponsors and event sponsors. Draws affluent golf community. Has established sponsorship and charitable giving programs. Military outreach program shows community investment.",
      "alignment": "LOW",
      "reasoning_alignment": "Golf event with no direct connection to service dogs, disability accessibility, or animal welfare. However, has community outreach and charitable components.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Professional corporate event with established volunteer and community programs. Has charitable giving infrastructure. Would need to go through formal sponsorship/partnership channels.",
      "impact": "HIGH",
      "reasoning_impact": "Major Hawaii event with access to wealthy sponsors, corporate partners, and affluent golf community. Association provides significant credibility. Could open doors to high-net-worth individuals and corporations.",
      "score": 65,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "Approach as a door opener to the affluent golf community and corporate sponsors. Propose FIDO as a charitable partner for the event (e.g., service dog demonstration at the tournament). The Sony Open's network of sponsors and attendees includes high-net-worth individuals who could become major donors."
    },
    {
      "handle": "k9kokua",
      "display_name": "K9 Kokua",
      "follower_count": 4843,
      "bio": "Nonprofit organization\nProviding direct outreach to dogs of the houseless on Oahu and Maui & those affected by domestic violence.\nlinktr.ee/K9Kokua",
      "website": "linktr.ee/K9Kokua",
      "hawaii_based": true,
      "reasoning_hawaii": "Serves Oahu and Maui. 'Kokua' is Hawaiian word for help. Website references local Hawaii partnerships (The Surfjack hotel). Linktree confirms Hawaii focus.",
      "entity_type": "nonprofit",
      "reasoning_type": "Hawaii nonprofit providing veterinary outreach to dogs of houseless individuals and domestic violence victims. Has rescue operations, vet care donations, and community events.",
      "capacity": "LOW",
      "reasoning_capacity": "Small nonprofit relying on donations and fundraising events. Serves vulnerable populations. Limited financial resources but strong community mission.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dog welfare nonprofit in Hawaii serving vulnerable populations. Direct mission overlap - both FIDO and K9 Kokua serve dogs and their handlers in Hawaii. Shared commitment to animal welfare and human-animal bond.",
      "relationship": "HIGH",
      "reasoning_relationship": "Fellow Hawaii animal welfare nonprofit. Natural ally. Community-engaged with events and fundraisers. Small enough to be highly collaborative.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Hawaii's animal welfare and social service networks. Can cross-refer clients and share community connections. 4.8K engaged followers in Hawaii's animal welfare community.",
      "score": 65,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a natural nonprofit partner. K9 Kokua serves dogs of vulnerable populations - the human-animal bond connection is directly aligned. Propose cross-referrals, co-hosted events, and shared advocacy. Their houseless outreach could identify individuals who might benefit from service dogs. This is a warm, mission-aligned partnership."
    },
    {
      "handle": "caninecardiohawaii",
      "display_name": "Mobile Dog Gym",
      "follower_count": 3070,
      "bio": "Oahu\nClimate controlled\nONLY mobile dog gym in Hawaii!\nOwned and operated by a veterinary professional",
      "website": "www.caninecardiohawaii.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'Oahu' and 'ONLY mobile dog gym in Hawaii!' Website confirms: 'Hawaii's first and only veterinary professional owned mobile dog gym!' based in Kailua.",
      "entity_type": "pet_industry",
      "reasoning_type": "Unique pet service business - mobile dog gym owned by veterinary professional. Canine exercise and fitness service on Oahu.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established business with professional website, unique niche (only mobile dog gym in Hawaii), veterinary professional owner. Has service areas, pricing, merchandise - organized operation. Kailua-based, female-owned.",
      "alignment": "HIGH",
      "reasoning_alignment": "Direct dog service business owned by veterinary professional. Canine health and fitness directly relates to service dog wellness. Veterinary expertise is valuable for service dog programs.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based, accessible via website and DM. Professional service provider in dog industry. Veterinary professional likely connected to broader pet/vet community in Hawaii.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Hawaii pet/veterinary community. Could refer clients, co-promote services. Unique niche gives some media appeal. But limited to dog owner clientele.",
      "score": 65,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Strong partnership candidate. Propose collaboration: mobile dog gym sessions for service dogs in training, cross-promotion to their client base, joint events. Veterinary professional owner could be a credible advocate. Offer to feature their services to Hawaii FIDO's network in exchange for discounted services or event sponsorship."
    },
    {
      "handle": "hawaiipetportraits",
      "display_name": "HAWAII'S PET PHOTOGRAPHER",
      "follower_count": 2341,
      "bio": "Lifestyle | Commercial | Editorial\nVOTED HONOLULU MAGAZINE'S 'BEST PET & YOU PHOTOS' JUNE 2020\n521 Ala Moana Blvd, M-423, Honolulu, Hawaii 96813",
      "website": "www.hawaiipetportraits.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Physical address: 521 Ala Moana Blvd, M-423, Honolulu, Hawaii 96813. Display name includes 'HAWAII'S'. Voted by Honolulu Magazine.",
      "entity_type": "local_business",
      "reasoning_type": "Professional pet photographer in Honolulu. Award-winning (Honolulu Magazine 'Best Pet & You Photos'). Offers lifestyle, commercial, and editorial photography.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established professional photographer with Ala Moana Blvd address (premium Honolulu location), award recognition, professional website, and commercial photography services. Revenue-generating professional business.",
      "alignment": "HIGH",
      "reasoning_alignment": "Pet photography directly serves Hawaii's pet community. Could photograph service dogs, create marketing materials, or donate photography services. Award-winning quality adds credibility.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based professional, award-winning, physical location in Honolulu. Professional operation that would be receptive to nonprofit partnerships for portfolio and community goodwill.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Hawaii pet community through photography clients. Award recognition (Honolulu Magazine) suggests media connections. Professional photography can significantly elevate Hawaii FIDO's marketing materials.",
      "score": 65,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Propose photography partnership: pro-bono or discounted photography of service dogs, graduation ceremonies, and training sessions. Professional pet photos significantly boost fundraising materials and social media engagement. Could co-host photo events (pet portraits for donation). Award-winning quality elevates Hawaii FIDO's brand."
    },
    {
      "handle": "dorothy.colby",
      "display_name": "Dorothy A. Colby",
      "follower_count": 216,
      "bio": "Positive Approach to Care Mentor & Trainer, Hale Ku'ike Director of Community Engagement\nwww.dorothycolby.com\nFollow\nMessage",
      "website": "dorothy.colby",
      "hawaii_based": true,
      "reasoning_hawaii": "Hale Ku'ike is a Hawaii-based organization (Hawaiian language name meaning 'House of Understanding'). The use of Hawaiian language in the organization name strongly indicates Hawaii-based.",
      "entity_type": "professional",
      "reasoning_type": "Professional working in care/disability sector. 'Positive Approach to Care Mentor & Trainer' and 'Director of Community Engagement' at Hale Ku'ike. Likely works in dementia care or disability services.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Professional with a director-level title at an organization. Has a personal website. Organizational affiliation provides some resource access. Moderate capacity through her professional network.",
      "alignment": "HIGH",
      "reasoning_alignment": "Works in care/disability sector ('Positive Approach to Care'). Director of Community Engagement - focused on community service and support for people needing care. Strong alignment with disability accessibility mission of service dogs.",
      "relationship": "HIGH",
      "reasoning_relationship": "Director of Community Engagement role means she is specifically responsible for community partnerships. Has personal website and professional presence. Very approachable for mission-aligned outreach.",
      "impact": "MEDIUM",
      "reasoning_impact": "Access to care community and disability network through Hale Ku'ike. Community engagement role means she connects with many organizations. Can open doors in the care/disability sector. But limited to her specific professional network.",
      "score": 65,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "High-value connection for door-opening. Dorothy's role in disability/care community engagement is directly relevant to service dog accessibility. Approach to discuss how service dogs benefit people in care settings. She can connect Hawaii FIDO to the broader disability and elder care community in Hawaii. Contact via dorothycolby.com or Instagram."
    },
    {
      "handle": "oursaviorhawaii",
      "display_name": "Our Savior Lutheran Church",
      "follower_count": 48,
      "bio": "Church. Worship Sundays 8:15am & 10:45am. 98-1098 Moanalua Road, Aiea, HI. You are a unique and unreproducible miracle of God!",
      "website": "oursaviorhawaii.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Address is '98-1098 Moanalua Road, Aiea, HI'. Name includes 'Hawaii'. Website confirms Hawaii location. Clearly Hawaii-based church.",
      "entity_type": "member_org",
      "reasoning_type": "Lutheran church in Aiea, Hawaii. Member-based religious organization with regular worship services, student ministry, ministries, and community programs. Website shows established church with staff, calendar, online giving, and school (Cross Academy PS-8).",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established church with physical location, staff, regular worship services, online giving capability, and a school (Cross Academy PS-8 Grade). Churches typically have congregations of dozens to hundreds of members. The school suggests significant organizational infrastructure.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Church with community service orientation. Partner ministries and community engagement. Churches often support local causes and community organizations. No direct animal/service dog connection but strong community service ethos.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based church with physical address, website, regular services, and multiple community programs. Churches are typically very welcoming to community presentations and partnership requests. Already following Hawaii FIDO.",
      "impact": "HIGH",
      "reasoning_impact": "Member-based organization with congregation access. Has a school (Cross Academy). One presentation to the congregation could reach dozens of potential donors. Church members tend to be community-minded and charitable. Multiple ministries and partner ministries expand reach further.",
      "score": 65,
      "outreach_type": "DOOR_OPENER",
      "outreach_strategy": "Good prospect as a door-opener. Request to present at a service, community event, or ministry meeting. One presentation reaches the entire congregation. The church's school (Cross Academy) offers additional outreach to families. Approach through the church office to request a speaking opportunity about Hawaii FIDO's mission. Churches with community ministries are often receptive to local nonprofit presentations."
    },
    {
      "handle": "vibecreativehawaii",
      "display_name": "Hawai'i Marketing Agency",
      "follower_count": 10400,
      "bio": "We exist to amplify the voices of values-driven orgs because when Hawaii businesses flourish everyone thrives",
      "website": "www.gotobio.link/vibecreativemarketing",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle includes 'hawaii', display name is 'Hawai'i Marketing Agency'. Bio explicitly focuses on Hawaii businesses. Verified business account.",
      "entity_type": "local_business",
      "reasoning_type": "Hawaii-based marketing agency that specifically serves 'values-driven organizations.' Is a verified business account. Professional service provider focused on amplifying local businesses.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Professional marketing agency with established business (1,195 posts, verified business account). Can offer pro-bono or discounted marketing services. Has professional expertise as a resource.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Explicitly serves 'values-driven orgs' - FIDO fits this description perfectly. Mission is to help organizations that make Hawaii thrive. Strong philosophical alignment even though not pet-specific.",
      "relationship": "HIGH",
      "reasoning_relationship": "Marketing agency that specifically seeks values-driven organizations to amplify. FIDO is exactly their target client type. Professional, approachable, and mission-aligned.",
      "impact": "MEDIUM",
      "reasoning_impact": "Can provide professional marketing services to amplify FIDO's message. 10.4K followers in Hawaii business community. Their client network includes other Hawaii organizations.",
      "score": 62,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Approach as a values-driven organization seeking marketing support. Vibe Creative specifically amplifies 'values-driven orgs' - FIDO is a perfect fit. Propose pro-bono or discounted marketing partnership. They could help FIDO with social media strategy, branding, and community outreach. This is a natural service partnership."
    },
    {
      "handle": "whoozagoodog",
      "display_name": "Whooza Goodog (WAGD Hawaii)",
      "follower_count": 2689,
      "bio": "Dog Goods & Services\nKALAHEO, KAUAI\n@mahinawithdogs",
      "website": "www.wagdhawaii.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'KALAHEO, KAUAI' and display name includes 'WAGD Hawaii'. Website is wagdhawaii.com.",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog goods and services business on Kauai. Established brand with dedicated website (wagdhawaii.com).",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Established pet business with dedicated website and brand. Located on Kauai with physical presence. Dog goods and services suggests ongoing revenue.",
      "alignment": "HIGH",
      "reasoning_alignment": "Direct dog goods and services business in Hawaii. Dog industry alignment is strong - they serve dog owners and understand the canine community. Kauai presence extends Hawaii FIDO's reach beyond Oahu.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based pet business, accessible via website and social media. Professional operation. Kauai location could help expand Hawaii FIDO's inter-island reach.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Kauai dog owner community. Could serve as retail partner or event host on Kauai. Inter-island reach is valuable but Kauai market is smaller than Oahu.",
      "score": 62,
      "outreach_type": "PARTNERSHIP",
      "outreach_strategy": "Good partnership candidate on Kauai. Propose carrying Hawaii FIDO merchandise, hosting adoption/awareness events, or cross-promoting to Kauai dog owner community. Inter-island partnership strengthens statewide presence. Could be a retail point-of-presence for Hawaii FIDO on Kauai."
    }
  ]
}