{
  "count": 15,
  "partners": [
    {
      "handle": "curtw923",
      "display_name": null,
      "follower_count": 908,
      "bio": "Public figure\nKSSK AM590 & FM92.3 Afternoon Drive Host (2-7p)\nksskradio.iheart.com/featured/curt-williams and 2 more",
      "website": "ksskradio.iheart.com/featured/curt-williams",
      "hawaii_based": true,
      "reasoning_hawaii": "KSSK is a major Hawaii radio station (AM590 & FM92.3). Website confirms Hawaii content: 'Hawaii Storm Watch', 'Hawaii News', 'Half Off Honolulu.' Radio host for Hawaii's local iHeart station.",
      "entity_type": "influencer",
      "reasoning_type": "Radio host for KSSK, a major Hawaii radio station. Afternoon drive host (2-7p) reaching significant local audience. Public figure with media influence.",
      "capacity": "MEDIUM",
      "reasoning_capacity": "Radio host at established Hawaii station (iHeart Media). Professional income but capacity is more about media influence than personal wealth. Has access to advertising resources and media platform.",
      "alignment": "LOW",
      "reasoning_alignment": "General radio host with no specific connection to service dogs, disability, or animal welfare. However, covers Hawaii community stories and events. Media platform could amplify any cause.",
      "relationship": "HIGH",
      "reasoning_relationship": "Public figure who regularly engages with community. Radio hosts are accustomed to community partnerships and promotional support. KSSK is a well-known Hawaii station. Active on social media (1617 posts).",
      "impact": "HIGH",
      "reasoning_impact": "Afternoon drive radio host reaches thousands of Hawaii listeners daily. One mention or interview about Hawaii FIDO could generate significant awareness and donations. Radio is a powerful local media channel. Connection to iHeart Media network adds further reach.",
      "score": 68,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Hawaii radio personality with significant local reach. Approach for a feature story or interview about Hawaii FIDO on KSSK afternoon drive. Radio hosts are natural storytellers and community advocates. Propose a 'pet of the week' or service dog awareness segment. Could also host a radiothon or fundraiser promotion. One interview during afternoon drive (2-7p) could reach thousands of Hawaii residents and drive donations."
    },
    {
      "handle": "jaxabreu",
      "display_name": "The Secret Life of Jax (Oahu,Hawaii) Prince 'Jax' Abreu",
      "follower_count": 7676,
      "bio": "Artist\nHawaii's Celebrity Yorkie\nSpreading Aloha, Laughter, Pineapplekisses\nHumaneSocietyTherapydog, TalkingSingingDog, Model\nthesecertlifeofjax.onuniverse.com",
      "website": "thesecertlifeofjax.onuniverse.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Display name includes '(Oahu,Hawaii).' Bio says 'Hawaii's Celebrity Yorkie.' Website confirms Hawaii location. References Hawaiian Humane Society.",
      "entity_type": "influencer",
      "reasoning_type": "Hawaii-based pet influencer. Therapy dog with Hawaiian Humane Society connection. Does paid collaborations, community events (Pups on Wheels, Our Kakaako). Celebrity Yorkie brand.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual pet influencer account. Value is in community visibility and connections rather than financial resources.",
      "alignment": "HIGH",
      "reasoning_alignment": "Therapy dog with Hawaiian Humane Society connection - directly aligned with FIDO's mission. Service/therapy dog focus, community events, and Hawaii-based pet advocacy.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based, already connected to Hawaiian Humane Society, does community events (Our Kakaako, Pups on Wheels), open to collaborations. Natural community partner.",
      "impact": "MEDIUM",
      "reasoning_impact": "7.7K Hawaii followers, therapy dog community connections, Hawaiian Humane Society relationship. Can amplify FIDO's message in the local pet/therapy dog community.",
      "score": 55,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Approach as a natural marketing partner. Jax is already a therapy dog with Hawaiian Humane Society ties - the connection to service dog advocacy is natural. Propose co-appearances at community events, social media features, and content collaboration highlighting service dogs in Hawaii."
    },
    {
      "handle": "macy_da_opihi",
      "display_name": "Macy | Dog Tricks - Hawaii",
      "follower_count": 2374,
      "bio": "Macy & DeAnna | Dog Trick Creator\nAussie Goldendoodle - Hawaii\nConfidence > perfection\nTeaching play-based dog...",
      "website": "linktr.ee/macy_da_opihi",
      "hawaii_based": true,
      "reasoning_hawaii": "Display name includes 'Hawaii', bio states 'Hawaii'. Handle uses 'opihi' which is a Hawaiian word (limpet). Linktree references products designed in Honolulu.",
      "entity_type": "influencer",
      "reasoning_type": "Dog trick content creator and trainer in Hawaii. Has brand partnerships (Honest Kitchen, Pupford, pet accessory brands), Amazon affiliate, YouTube channel. Teaching play-based dog training.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual content creator with brand partnerships but not a business with significant financial resources. Influencer-level operation.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dog training content creator in Hawaii - directly connected to dog training world. Play-based training approach aligns with positive reinforcement methods used in service dog training. Connected to Honolulu pet brands (Ports + Paws designed in Honolulu).",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based, active content creator, professional brand partnerships show approachability. Connected to Hawaii pet industry through local brands.",
      "impact": "MEDIUM",
      "reasoning_impact": "2374 followers with dog training content. Connected to multiple pet brands. YouTube presence extends reach. Could amplify Hawaii FIDO's message through dog training content niche.",
      "score": 52,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Good marketing partner. Propose collaboration: feature service dogs in training content, co-create educational content about service dog training, or promote Hawaii FIDO events. Their dog training audience is naturally interested in service dogs. Could create compelling content showing service dog training journey."
    },
    {
      "handle": "mshanapaa.mrkoli",
      "display_name": "Hana & Koli",
      "follower_count": 1993,
      "bio": "Digital creator\nHana adopted from Kona, HI. CGC\nKoli @kauaihumanesociety 10/23/23\nBustah Bendah\nOahu, HI",
      "website": "linktr.ee/MsHanapaa.MrKoli",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio states 'Oahu, HI'. Dogs adopted from Kona, HI and Kauai Humane Society. Deep Hawaii connection across multiple islands.",
      "entity_type": "influencer",
      "reasoning_type": "Dog content creator on Oahu with adopted rescue dogs. Has brand partnerships (Maggie and the Mews, Ports + Paws, Lulali Studio) and CGC certification. Digital creator designation.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual content creator with brand partnerships. No significant business infrastructure or financial resources beyond influencer income.",
      "alignment": "HIGH",
      "reasoning_alignment": "Dogs adopted from Hawaii shelters (Kona, Kauai Humane Society) - strong animal rescue alignment. CGC (Canine Good Citizen) certification shows training commitment. Connected to Hawaii pet brands designed in Honolulu. Dog welfare advocate.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii-based, active content creator, connected to Kauai Humane Society and multiple Hawaii pet brands. Deep roots in Hawaii dog rescue community. Approachable through brand/partnership channels.",
      "impact": "MEDIUM",
      "reasoning_impact": "Connected to Hawaii animal rescue community (Kauai Humane Society). Content reaches Hawaii dog community. Brand partnerships show influence. Rescue dog story creates compelling advocacy narrative.",
      "score": 50,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Good marketing partner for awareness campaigns. Rescue dog background creates natural storytelling angle for service dog awareness. Could feature Hawaii FIDO in content, share fundraising campaigns, or participate in events. Connection to Kauai Humane Society could facilitate inter-island rescue/service dog collaborations."
    },
    {
      "handle": "humphreysaccaro",
      "display_name": "HUMPHREY",
      "follower_count": 64300,
      "bio": "Honolulu, Hawaii\nMommy's boy @sammmysaccaro\n7-24-19\nProfessional rock diver\nlinktr.ee/humphreysaccaro",
      "website": "linktr.ee/humphreysaccaro",
      "hawaii_based": true,
      "reasoning_hawaii": "Explicit 'Honolulu, Hawaii' location in bio. Website content references 'American Savings Bank Buy Local Hawaii' giveaway.",
      "entity_type": "influencer",
      "reasoning_type": "Pet influencer account (likely a dog based on 'Mommy's boy' and pet-related website links to Earth Animal, Dr. Harvey's pet products). 64.3K followers with brand partnerships.",
      "capacity": "LOW",
      "reasoning_capacity": "Pet influencer account - not a business with significant funding capacity. Value is in audience reach, not direct donations.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Pet-focused account in Hawaii. Website links to natural pet products. While not service-dog specific, the pet community overlap provides some alignment.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based, active on social media, engaged with pet community and local brands. Linktree shows collaborative nature.",
      "impact": "MEDIUM",
      "reasoning_impact": "64.3K followers in Hawaii pet community. Could amplify FIDO's message to pet-loving audience. Marketing partner potential rather than donor.",
      "score": 38,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Approach as a marketing partner. Request a feature post or story about Hawaii FIDO's mission. Pet influencer audience is warm to animal welfare causes. Could co-create content highlighting service dogs in Hawaii."
    },
    {
      "handle": "sunny_aloha_in_paradise",
      "display_name": "sunny-aloha",
      "follower_count": 3905,
      "bio": "News personality\n'Aloha Oprah' ~ Radio Host/PR ~ Past Radio Stations ~ 8 yrs on KPRP 650AM & 1 1/2 yrs with 104.7FM. Sharing Hawaii's...",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Hawaii radio personality. 8 years on KPRP 650AM, 1.5 years on 104.7FM (Hawaii radio stations). 'Aloha Oprah' nickname. 'Sharing Hawaii's' content. 15,763 posts shows high activity.",
      "entity_type": "influencer",
      "reasoning_type": "Hawaii media personality - radio host and PR professional. 'Aloha Oprah' with extensive Hawaii media experience (KPRP 650AM, 104.7FM). Community-focused content creator.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual media personality. Radio host/PR professional. No significant business or organizational resources.",
      "alignment": "LOW",
      "reasoning_alignment": "Media personality with community focus but no direct connection to pets, service dogs, or disability. General Hawaii community content.",
      "relationship": "HIGH",
      "reasoning_relationship": "Hawaii media personality with extensive local radio and PR experience. Very high activity (15,763 posts). Connected to Hawaii's media landscape. Approachable community figure.",
      "impact": "MEDIUM",
      "reasoning_impact": "Hawaii media personality with radio experience and PR expertise. Could provide media coverage, radio mentions, or PR support for FIDO events. Connected to Hawaii's media community.",
      "score": 38,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Approach as a media/PR partner. Sunny Aloha has extensive Hawaii radio and PR experience. Request a radio interview or media feature about FIDO's mission. Her 'Aloha Oprah' persona and community focus make her a natural advocate for local causes."
    },
    {
      "handle": "payapup",
      "display_name": "Papaya",
      "follower_count": 6659,
      "bio": "adventures of a fluffy island bear\nmsha.ke/payapup\nHighlights: training (r+), care, interisland, PSD, pup training",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "'Island bear' and 'interisland' references suggest Hawaii. PSD (Psychiatric Service Dog) highlight suggests service dog involvement.",
      "entity_type": "individual",
      "reasoning_type": "Individual pet account with service dog (PSD - Psychiatric Service Dog) focus. Training highlights suggest involvement in positive reinforcement dog training.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual pet/service dog owner account. No business or organizational resources.",
      "alignment": "HIGH",
      "reasoning_alignment": "PSD (Psychiatric Service Dog) highlight indicates direct service dog experience. Training content using positive reinforcement. Directly in FIDO's target community - service dog handlers in Hawaii.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based service dog handler with community engagement. Could be a personal connection and advocate within the service dog community.",
      "impact": "LOW",
      "reasoning_impact": "6.7K followers. Individual with limited organizational reach, but authentic service dog experience adds credibility to any collaboration.",
      "score": 35,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Approach as a community voice. Papaya appears to be a service dog handler in Hawaii with training experience. Could share authentic testimonials about service dog access, provide content for FIDO's social media, and connect FIDO with the local service dog handler community."
    },
    {
      "handle": "thecoconutpages",
      "display_name": "The Coconut Pages - FOOD, HEALTH & COMMUNITY COLLAB",
      "follower_count": 8697,
      "bio": "Hawaii's food, health & community network\nTag a local brand/business to collab\nBook social media\nJoin channel\nbuymeacoffee.com/TanaJanelSuchaya",
      "website": "buymeacoffee.com/TanaJanelSuchaya",
      "hawaii_based": true,
      "reasoning_hawaii": "Display name and bio reference 'Hawaii's food, health & community network.' Focus on local brands/businesses. Uses 'coconut' as Hawaii-centric branding.",
      "entity_type": "influencer",
      "reasoning_type": "Hawaii community content creator/network builder. Connects local brands and businesses. Social media collaboration platform for Hawaii businesses.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual content creator using Buy Me a Coffee for support. Not a business with significant resources. Value is in network connections, not financial capacity.",
      "alignment": "LOW",
      "reasoning_alignment": "Food, health, and community focus. No direct connection to pets, service dogs, or disability. Community orientation is general rather than mission-specific.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based community connector who actively seeks collaborations with local organizations. Open to partnerships. Community network could include FIDO's audience.",
      "impact": "MEDIUM",
      "reasoning_impact": "8.7K followers in Hawaii's local business/community network. Can connect FIDO with other Hawaii businesses and amplify messages through their network.",
      "score": 32,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Approach for community marketing collaboration. The Coconut Pages connects Hawaii brands and businesses. Request a feature collaboration highlighting FIDO as a local values-driven organization. Low cost, modest reach, but authentic Hawaii community connection."
    },
    {
      "handle": "yafavoritelatinaa",
      "display_name": "Asianna Saragosa-Llarinas",
      "follower_count": 43800,
      "bio": "@stanleyxiao / @yafavoritepuppy / @yafavecollectors\nKHON2, HINOW, HNN references",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio references KHON2, HINOW, and HNN - all Hawaii news stations. These are strong Hawaii location indicators.",
      "entity_type": "influencer",
      "reasoning_type": "Social media personality with 43.8K followers. Has been featured on multiple Hawaii news stations (KHON2, HI NOW, HNN). Has a puppy-related side account (@yafavoritepuppy).",
      "capacity": "LOW",
      "reasoning_capacity": "Individual influencer, not a business or organization. No evidence of significant financial resources or organizational backing.",
      "alignment": "LOW",
      "reasoning_alignment": "Has a puppy account (@yafavoritepuppy) suggesting pet interest, but no direct connection to service dogs, disability, or community service causes.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based with media connections (featured on local news). Has local visibility and could be approachable for community causes.",
      "impact": "MEDIUM",
      "reasoning_impact": "43.8K followers plus Hawaii media connections (KHON2, HI NOW, HNN) could amplify messages. Local celebrity status adds credibility.",
      "score": 30,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Approach as a marketing partner leveraging her Hawaii media connections and local following. Could request a feature or shoutout for FIDO. Her puppy interest makes the connection more natural."
    },
    {
      "handle": "whoisgyr",
      "display_name": "George Y. Russell",
      "follower_count": 875,
      "bio": "Filmmaker/Producer\nBased in Honolulu, Hawaii\nProud yonsei (4th gen. Japanese/American) made up of 🇯🇵🇬🇧🇸🇪🇩🇰🇧🇪🇫🇷Born...\nmore",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'Based in Honolulu, Hawaii.' Identifies as yonsei (4th generation Japanese-American), indicating deep Hawaii roots.",
      "entity_type": "professional",
      "reasoning_type": "Professional filmmaker and producer based in Honolulu. Creative industry professional with deep Hawaii roots (4th generation Japanese-American).",
      "capacity": "LOW",
      "reasoning_capacity": "Individual filmmaker/producer. Creative professional but no indicators of significant financial resources. No website listed, small following.",
      "alignment": "LOW",
      "reasoning_alignment": "No direct connection to service dogs, disability, or animal welfare. Film/media professional who could potentially create content but no mission overlap indicated.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Honolulu-based with deep local roots (4th gen Japanese-American). Filmmakers are often community-connected and open to storytelling opportunities. Could be interested in documenting Hawaii FIDO's story.",
      "impact": "MEDIUM",
      "reasoning_impact": "As a filmmaker/producer, could create compelling video content about Hawaii FIDO's mission. Media production skills have amplification potential. However, limited institutional network.",
      "score": 30,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Honolulu-based filmmaker with deep local roots. Could be approached to create documentary-style content about Hawaii FIDO's service dog program. A compelling film about service dogs in Hawaii could be a powerful fundraising and awareness tool. Lower priority but worth a soft outreach to explore pro-bono or reduced-rate video production."
    },
    {
      "handle": "auntie_kai_hawaii",
      "display_name": "Auntie Kai Hawaii",
      "follower_count": 633,
      "bio": "Our Life Hawaii 2Explore+Photos♡Weiner Dogs. Everylifefoundation,Congress. 3C Diabetes, Dercum's, Elher's Danlos,...",
      "website": "",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle includes 'hawaii'. Display name is 'Auntie Kai Hawaii'. Bio says 'Our Life Hawaii'. 'Auntie' is classic Hawaiian pidgin term of respect.",
      "entity_type": "individual",
      "reasoning_type": "Personal account of someone living in Hawaii with dachshunds (weiner dogs). Mentions several medical conditions (Diabetes, Dercum's Disease, Ehlers-Danlos Syndrome) and advocacy (Everylifefoundation, Congress).",
      "capacity": "LOW",
      "reasoning_capacity": "Individual with multiple chronic health conditions. No business or professional capacity indicators. Personal advocacy account.",
      "alignment": "HIGH",
      "reasoning_alignment": "Strong alignment on multiple fronts: dog owner (weiner dogs), disability/chronic illness advocate (Ehlers-Danlos, Dercum's, Diabetes), mentions Everylifefoundation and Congress suggesting active advocacy. Someone with disabilities who has dogs would deeply understand the value of service dogs.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based with advocacy experience (engaging with Congress). Active community member. The 'Auntie' designation suggests community elder/respected role. Could be approachable as someone who understands both disability and dog ownership.",
      "impact": "LOW",
      "reasoning_impact": "Individual account with limited reach. While personally aligned, does not have organizational multiplier effect.",
      "score": 30,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Low priority but interesting alignment. Could be a testimonial partner or social media advocate given her personal experience with disability and dog ownership in Hawaii. Not a funding source but could authentically share Hawaii FIDO's message with her disability advocacy network."
    },
    {
      "handle": "cocoinhawaii",
      "display_name": "Dogzilla Boutique",
      "follower_count": 421,
      "bio": "Clothing (Brand)\nAloha! My name is Coco, and I'm a Dogzilla. I love counter surfing, zooming in the park, and spreading pawsitive vibes...",
      "website": "dogzillaboutique.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Handle is 'cocoinhawaii', bio uses 'Aloha!', and website has a 'MAHALOHAWAII' section. Clearly Hawaii-based.",
      "entity_type": "local_business",
      "reasoning_type": "Dog-themed clothing boutique (e-commerce). Sells apparel and accessories for men, women, kids, and canines with dog-themed designs.",
      "capacity": "LOW",
      "reasoning_capacity": "Small e-commerce boutique with 421 followers. Appears to be a small/hobby-level business. Limited financial resources for donations.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Dog-focused brand with pet-positive messaging ('pawsitive vibes', 'ALL DOGS MATTER'). Pet industry adjacent. Shared audience with dog lovers.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based, dog-focused, community-oriented brand. Accessible via business contact. Could be open to cross-promotion.",
      "impact": "LOW",
      "reasoning_impact": "Small boutique with limited reach (421 followers). Some marketing potential but minimal multiplier effect.",
      "score": 30,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Potential marketing partner for cross-promotion. Could carry Hawaii FIDO merchandise or feature the organization. Small scale but aligned audience. Consider co-branded products or donation percentage partnerships."
    },
    {
      "handle": "galaxychihuahuas",
      "display_name": "Galaxy Chihuahua's",
      "follower_count": 3478,
      "bio": "Digital creator\nOahu,Hawaii! We are passionate and dedicated in raising well socialized, top quality applehead Chihuahuas to AKC...",
      "website": "sites.google.com/view/galaxychihuahuas/home",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'Oahu,Hawaii!' Website confirms: 'We are located in Hawaii' and 'have recently moved to Hawaii on the beautiful island'.",
      "entity_type": "pet_industry",
      "reasoning_type": "Dog breeder specializing in AKC Chihuahuas on Oahu. Has website with Available Puppies, Meet the Parents sections - organized breeding operation.",
      "capacity": "LOW",
      "reasoning_capacity": "Small dog breeding operation using Google Sites for website. Likely home-based business with limited financial resources beyond breeding income.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Pet industry with dog breeding focus. Understands canine world and AKC standards. Some overlap with service dog community through dog training/socialization expertise, but breeding Chihuahuas is not directly aligned with service dogs.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based pet business, active on social media, accessible via DM. Connected to Hawaii dog community.",
      "impact": "LOW",
      "reasoning_impact": "Small breeder with limited network beyond Chihuahua buyers. Not a significant door-opener to broader funding or partnerships.",
      "score": 28,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Low priority. Could cross-promote Hawaii FIDO to their dog-loving audience. Consider reaching out for community dog events or awareness campaigns targeting Oahu dog owners."
    },
    {
      "handle": "pahoapetgrooming",
      "display_name": "Pahoa Pet Grooming",
      "follower_count": 335,
      "bio": "Pet Groomer\nProviding affordable, personalized pet grooming to the Puna District of Hawai'i Island!",
      "website": "www.pahoapetgrooming.com",
      "hawaii_based": true,
      "reasoning_hawaii": "Bio explicitly states 'Puna District of Hawai'i Island'. Website confirms Pahoa, Hawaii location with 808 phone number. Zip code 96778.",
      "entity_type": "pet_industry",
      "reasoning_type": "Pet grooming business serving the Puna District of Hawaii Island. Small local pet service business.",
      "capacity": "LOW",
      "reasoning_capacity": "Small local pet grooming business on Hawaii Island. Affordable positioning suggests modest revenue. Small following (335). Limited financial capacity for donations.",
      "alignment": "MEDIUM",
      "reasoning_alignment": "Pet industry business with shared customer base (dog owners). Not directly service dog related but understands the pet community and animal care.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Hawaii-based pet business with a physical location and website. Business account with professional presence. Accessible via business contact.",
      "impact": "LOW",
      "reasoning_impact": "Small local business on Hawaii Island with limited reach beyond Puna District. 335 followers. No significant multiplier effect.",
      "score": 28,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Small Hawaii Island pet grooming business. Could display Hawaii FIDO brochures, refer dog-owning clients, or cross-promote. Limited financial capacity but could be a community-level awareness partner. Low priority."
    },
    {
      "handle": "qt_and_me",
      "display_name": "dara Fukuhara",
      "follower_count": 83,
      "bio": "This is the journey of a miniature labradoodle puppy, QT, becoming a service dog with her human. Watch us grow!",
      "website": "",
      "hawaii_based": false,
      "reasoning_hawaii": "No explicit Hawaii indicators in bio. The surname 'Fukuhara' could suggest Japanese-Hawaiian heritage but is not conclusive. No location mentioned.",
      "entity_type": "individual",
      "reasoning_type": "Individual documenting their service dog training journey. Service dog handler/trainer in progress.",
      "capacity": "LOW",
      "reasoning_capacity": "Individual with 83 followers documenting personal service dog journey. No business or financial indicators.",
      "alignment": "HIGH",
      "reasoning_alignment": "Directly involved in service dog training - documenting a labradoodle puppy becoming a service dog. This is core mission alignment with Hawaii FIDO.",
      "relationship": "MEDIUM",
      "reasoning_relationship": "Active content creator in the service dog space with 71 posts. Already engaged in the community. Surname Fukuhara may suggest Hawaii connection.",
      "impact": "LOW",
      "reasoning_impact": "83 followers, individual account. Passionate about service dogs but limited broader reach.",
      "score": 28,
      "outreach_type": "MARKETING_PARTNER",
      "outreach_strategy": "Low-priority marketing partner. Strong service dog alignment but limited reach. Could be a content collaborator or testimonial partner. Worth a follow and engagement to build organic relationship. If Hawaii-based, value increases significantly."
    }
  ]
}